{"topic":{"735":"blackhole","770":"blackhole","736":"blackhole","771":"blackhole","737":"blackhole"},"youtube_link":{"735":"https:\/\/youtu.be\/rUvFbJYWGDA?t=284","770":"https:\/\/youtu.be\/rUvFbJYWGDA","736":"https:\/\/youtu.be\/rUvFbJYWGDA?t=284","771":"https:\/\/youtu.be\/rUvFbJYWGDA","737":"https:\/\/youtu.be\/rUvFbJYWGDA?t=284"},"wired_link":{"735":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","770":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","736":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","771":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","737":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty"},"dialog_lvl":{"735":"undergrad","770":"undergrad","736":"undergrad","771":"undergrad","737":"undergrad"},"dialog_id":{"735":"blackhole_5","770":"blackhole_5","736":"blackhole_5","771":"blackhole_5","737":"blackhole_5"},"speaker_id":{"735":1,"770":4,"736":1,"771":4,"737":1},"reciever_id":{"735":4,"770":1,"736":4,"771":1,"737":4},"turn_id":{"735":1,"770":2,"736":3,"771":4,"737":5},"turn":{"735":["So far, what do you know about black holes?"],"770":["I never knew beforehand how hard it was","to get actual data of the black holes itself,","first of all, they're dark, and, like,","they're so far away, it's almost impossible just","to get a good image of them.","They were discussing a project in","which multiple radio telescopes of some sort, like, are,","like, pinpointed all across, from Greenland","to South America, and, like, and they're trying to","get an image of","the black hole in the center","of our galaxy because, as opposed","to just recording its impact","on the surrounding stars and planets."],"736":["So we've been, we've had, now,","effectively two different ways","of getting more direct measurements, one is the LIGO, which","is the Laser Interferometer Gravitational Wave Observatory,","which is where, getting the ripples in space time,","coming off of the merging of black holes.","The other one that you're mentioning is actually called","the Event Horizon Telescope, where they're using radio waves","to actually image the event horizon,","that region where light cannot escape","from the black hole at the center of our galaxy,","which I know they're working on it right now.","It's an amazing thing,","but that'll be the most direct imaging of a black hole.","LIGO is a direct detection of the consequence","of the merging of black holes.","The critical part has been, like,","for the super massive black hole at the center","of our galaxy, we've seen the stars orbiting it,","and we've measured the mass, so that way,","so if you look at a spinning black hole,","it actually fundamentally alters the emission","that's coming off the stuff that's falling into it.","These are discovered as what are called X-ray binaries,","that is, you know, there's an X-ray member","of the binary that is emitting in the X-rays,","and it's really not very bright","in the optical (mumbles) at all, so there's always,","people are looking at these X-ray binaries."],"771":["What sort of technology and, like,","I guess tools have you been using","in your studies, or, like, just in general,","in the study of black holes?"],"737":["For my studies, I actually, when I started at UCLA","in graduate school, I worked","with a professor named Matt Malkin who was,","gotten a lot of data observations","from the Hubble Space Telescope, so that was one","of my very first projects to work on, so any,","space-based observatories have been a really big advantage,","and then I've moved on now to the Spitzer Space Telescope.","In addition to that, then there's other people","who've used a lot of X-ray telescopes,","NuSTAR, Chandra have used data from that.","It's been a combination of both ground-based observatories,","as well as space-based ones, and going everywhere","from X-ray observations, not done by me,","but certainly ultraviolet, and then optical,","and infrared, particularly, those are the ones","that I've been most involved with."]},"turn_sentences":{"735":["So far, what do you know about black holes?"],"770":["I never knew beforehand how hard it was to get actual data of the black holes itself, first of all, they're dark, and, like, they're so far away, it's almost impossible just to get a good image of them.","They were discussing a project in which multiple radio telescopes of some sort, like, are, like, pinpointed all across, from Greenland to South America, and, like, and they're trying to get an image of the black hole in the center of our galaxy because, as opposed to just recording its impact on the surrounding stars and planets."],"736":["So we've been, we've had, now, effectively two different ways of getting more direct measurements, one is the LIGO, which is the Laser Interferometer Gravitational Wave Observatory, which is where, getting the ripples in space time, coming off of the merging of black holes.","The other one that you're mentioning is actually called the Event Horizon Telescope, where they're using radio waves to actually image the event horizon, that region where light cannot escape from the black hole at the center of our galaxy, which I know they're working on it right now.","It's an amazing thing, but that'll be the most direct imaging of a black hole.","LIGO is a direct detection of the consequence of the merging of black holes.","The critical part has been, like, for the super massive black hole at the center of our galaxy, we've seen the stars orbiting it, and we've measured the mass, so that way, so if you look at a spinning black hole, it actually fundamentally alters the emission that's coming off the stuff that's falling into it.","These are discovered as what are called X-ray binaries, that is, you know, there's an X-ray member of the binary that is emitting in the X-rays, and it's really not very bright in the optical (mumbles) at all, so there's always, people are looking at these X-ray binaries."],"771":["What sort of technology and, like, I guess tools have you been using in your studies, or, like, just in general, in the study of black holes?"],"737":["For my studies, I actually, when I started at UCLA in graduate school, I worked with a professor named Matt Malkin who was, gotten a lot of data observations from the Hubble Space Telescope, so that was one of my very first projects to work on, so any, space-based observatories have been a really big advantage, and then I've moved on now to the Spitzer Space Telescope.","In addition to that, then there's other people who've used a lot of X-ray telescopes, NuSTAR, Chandra have used data from that.","It's been a combination of both ground-based observatories, as well as space-based ones, and going everywhere from X-ray observations, not done by me, but certainly ultraviolet, and then optical, and infrared, particularly, those are the ones that I've been most involved with."]},"turn_num_tokens":{"735":11,"770":117,"736":274,"771":34,"737":158},"role":{"735":"Explainer","770":"Explainee","736":"Explainer","771":"Explainee","737":"Explainer"}}