{"topic":{"730":"blackhole","766":"blackhole","731":"blackhole","767":"blackhole","732":"blackhole","768":"blackhole","733":"blackhole","769":"blackhole","734":"blackhole"},"youtube_link":{"730":"https:\/\/youtu.be\/rUvFbJYWGDA?t=115","766":"https:\/\/youtu.be\/rUvFbJYWGDA","731":"https:\/\/youtu.be\/rUvFbJYWGDA?t=115","767":"https:\/\/youtu.be\/rUvFbJYWGDA","732":"https:\/\/youtu.be\/rUvFbJYWGDA?t=115","768":"https:\/\/youtu.be\/rUvFbJYWGDA","733":"https:\/\/youtu.be\/rUvFbJYWGDA?t=115","769":"https:\/\/youtu.be\/rUvFbJYWGDA","734":"https:\/\/youtu.be\/rUvFbJYWGDA?t=115"},"wired_link":{"730":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","766":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","731":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","767":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","732":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","768":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","733":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","769":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","734":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty"},"dialog_lvl":{"730":"teenager","766":"teenager","731":"teenager","767":"teenager","732":"teenager","768":"teenager","733":"teenager","769":"teenager","734":"teenager"},"dialog_id":{"730":"blackhole_4","766":"blackhole_4","731":"blackhole_4","767":"blackhole_4","732":"blackhole_4","768":"blackhole_4","733":"blackhole_4","769":"blackhole_4","734":"blackhole_4"},"speaker_id":{"730":1,"766":3,"731":1,"767":3,"732":1,"768":3,"733":1,"769":3,"734":1},"reciever_id":{"730":3,"766":1,"731":3,"767":1,"732":3,"768":1,"733":3,"769":1,"734":3},"turn_id":{"730":1,"766":2,"731":3,"767":4,"732":5,"768":6,"733":7,"769":8,"734":9},"turn":{"730":["So tell me, what do you know about black holes?"],"766":["Well, I know they're created when stars,","once they start growing, it doesn't,","it can't expand anymore, so they collapse inward."],"731":["You got, pretty much, you got a very good idea about it.","Basically you have a star,","at the core its generating energy,","which is countering the pressure","of all that mass trying, being pulled in by gravity.","Once it can't generate that energy anymore,","the core collapses, once the core is collapsing,","it keeps collapsing, and collapsing, and collapsing,","and that's the critical thing that makes a black hole.","You have enough mass in the volume,","such that the escaped velocity becomes the speed of light,","once light can't escape, hence the black part. (laughs)","But that's the thing, is that just","because there's an intense amount","of gravity very close to a black hole,","things don't start behaving differently.","And my favorite analogy is a vacuum, everybody thinks, like,","if you point a vacuum cleaner at something,","it's just gonna suck everything in--"],"767":["But no, the wind, the pull isn't,","if you're not close enough, it doesn't work."],"732":["Right, you will feel the gravitational pull,","and it'll redirect you in some way,","and if you're far enough way,","it's just like you're very far away","from the sun, or something else.","If you're close enough, it will divert your path more,","if you're close enough still, then you will get","what are called tidal forces, where the difference between,","for example, if you're standing next to a black hole,","the difference in gravity between your feet","and your head actually becomes significant.","Next time you see a science fiction movie,","if somebody says, Oh, my god, we've been caught","in the gravitation field of a black hole,","and we're gonna fall in, it's like,","no, no, just, if you're far enough away,","just thrust a little bit this way,","and then you'll slingshot around the black hole."],"768":["So are there any movies that actually do,","like, get space right?"],"733":["I wouldn't call them educational,","but the movie Interstellar actually had,","as one of the people involved in both writing it,","and as a science advisor, Dr. Kip Thorne,","who's a Professor at Caltech, who was part of the team","that detected gravitational waves,","and just won a Nobel Prize for it.","So he made sure to try and get it as accurate as possible,","so Interstellar, I think, is one of the best examples","of getting black holes right."],"769":["So it's, I'm assuming it's hard to,","like, detect a black hole, besides if it's,","if things are close enough that they're being pulled in,","so it's basically a theory?"],"734":["It's, there're multiple theories,","there's observational evidence,","more than some other theories that are really feeding","into this because now we have the instrumentation,","both in X-rays and infrared, in particular,","because we don't have a direct optical line","of sight to the center of our galaxy","because there's just a lot of dust in the way.","But the infrared can penetrate the dust,","the X-rays can penetrate the dust,","the radio can penetrate all of that dust,","so by combining all of these different wavelengths,","people are really coming to a point","of okay, how is this happening,","by looking at different wavelengths of light,","we can get a better sense, but they're still working","on the theory, it's not all done."]},"turn_sentences":{"730":["So tell me, what do you know about black holes?"],"766":["Well, I know they're created when stars, once they start growing, it doesn't, it can't expand anymore, so they collapse inward."],"731":["You got, pretty much, you got a very good idea about it.","Basically you have a star, at the core its generating energy, which is countering the pressure of all that mass trying, being pulled in by gravity.","Once it can't generate that energy anymore, the core collapses, once the core is collapsing, it keeps collapsing, and collapsing, and collapsing, and that's the critical thing that makes a black hole.","You have enough mass in the volume, such that the escaped velocity becomes the speed of light, once light can't escape, hence the black part.","(laughs) But that's the thing, is that just because there's an intense amount of gravity very close to a black hole, things don't start behaving differently.","And my favorite analogy is a vacuum, everybody thinks, like, if you point a vacuum cleaner at something, it's just gonna suck everything in--"],"767":["But no, the wind, the pull isn't, if you're not close enough, it doesn't work."],"732":["Right, you will feel the gravitational pull, and it'll redirect you in some way, and if you're far enough way, it's just like you're very far away from the sun, or something else.","If you're close enough, it will divert your path more, if you're close enough still, then you will get what are called tidal forces, where the difference between, for example, if you're standing next to a black hole, the difference in gravity between your feet and your head actually becomes significant.","Next time you see a science fiction movie, if somebody says, Oh, my god, we've been caught in the gravitation field of a black hole, and we're gonna fall in, it's like, no, no, just, if you're far enough away, just thrust a little bit this way, and then you'll slingshot around the black hole."],"768":["So are there any movies that actually do, like, get space right?"],"733":["I wouldn't call them educational, but the movie Interstellar actually had, as one of the people involved in both writing it, and as a science advisor, Dr. Kip Thorne, who's a Professor at Caltech, who was part of the team that detected gravitational waves, and just won a Nobel Prize for it.","So he made sure to try and get it as accurate as possible, so Interstellar, I think, is one of the best examples of getting black holes right."],"769":["So it's, I'm assuming it's hard to, like, detect a black hole, besides if it's, if things are close enough that they're being pulled in, so it's basically a theory?"],"734":["It's, there're multiple theories, there's observational evidence, more than some other theories that are really feeding into this because now we have the instrumentation, both in X-rays and infrared, in particular, because we don't have a direct optical line of sight to the center of our galaxy because there's just a lot of dust in the way.","But the infrared can penetrate the dust, the X-rays can penetrate the dust, the radio can penetrate all of that dust, so by combining all of these different wavelengths, people are really coming to a point of okay, how is this happening, by looking at different wavelengths of light, we can get a better sense, but they're still working on the theory, it's not all done."]},"turn_num_tokens":{"730":12,"766":30,"731":181,"767":23,"732":179,"768":15,"733":94,"769":43,"734":147},"role":{"730":"Explainer","766":"Explainee","731":"Explainer","767":"Explainee","732":"Explainer","768":"Explainee","733":"Explainer","769":"Explainee","734":"Explainer"}}