{"topic":{"778":"blackhole","744":"blackhole","779":"blackhole","745":"blackhole","780":"blackhole","746":"blackhole","781":"blackhole","747":"blackhole","782":"blackhole","748":"blackhole","783":"blackhole","749":"blackhole","784":"blackhole","750":"blackhole"},"youtube_link":{"778":"https:\/\/youtu.be\/rUvFbJYWGDA","744":"https:\/\/youtu.be\/rUvFbJYWGDA?t=630","779":"https:\/\/youtu.be\/rUvFbJYWGDA","745":"https:\/\/youtu.be\/rUvFbJYWGDA?t=630","780":"https:\/\/youtu.be\/rUvFbJYWGDA","746":"https:\/\/youtu.be\/rUvFbJYWGDA?t=630","781":"https:\/\/youtu.be\/rUvFbJYWGDA","747":"https:\/\/youtu.be\/rUvFbJYWGDA?t=630","782":"https:\/\/youtu.be\/rUvFbJYWGDA","748":"https:\/\/youtu.be\/rUvFbJYWGDA?t=630","783":"https:\/\/youtu.be\/rUvFbJYWGDA","749":"https:\/\/youtu.be\/rUvFbJYWGDA?t=630","784":"https:\/\/youtu.be\/rUvFbJYWGDA","750":"https:\/\/youtu.be\/rUvFbJYWGDA?t=630"},"wired_link":{"778":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","744":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","779":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","745":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","780":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","746":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","781":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","747":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","782":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","748":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","783":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","749":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","784":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","750":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty"},"dialog_lvl":{"778":"colleague","744":"colleague","779":"colleague","745":"colleague","780":"colleague","746":"colleague","781":"colleague","747":"colleague","782":"colleague","748":"colleague","783":"colleague","749":"colleague","784":"colleague","750":"colleague"},"dialog_id":{"778":"blackhole_7","744":"blackhole_7","779":"blackhole_7","745":"blackhole_7","780":"blackhole_7","746":"blackhole_7","781":"blackhole_7","747":"blackhole_7","782":"blackhole_7","748":"blackhole_7","783":"blackhole_7","749":"blackhole_7","784":"blackhole_7","750":"blackhole_7"},"speaker_id":{"778":6,"744":1,"779":6,"745":1,"780":6,"746":1,"781":6,"747":1,"782":6,"748":1,"783":6,"749":1,"784":6,"750":1},"reciever_id":{"778":1,"744":6,"779":1,"745":6,"780":1,"746":6,"781":1,"747":6,"782":1,"748":6,"783":1,"749":6,"784":1,"750":6},"turn_id":{"778":1,"744":2,"779":3,"745":4,"780":5,"746":6,"781":7,"747":8,"782":9,"748":10,"783":11,"749":12,"784":13,"750":14},"turn":{"778":["So how do you do your observations","in optical and infrared?"],"744":["So fortunately there's, I'm also doing it","from space with the Spitzer Space Telescope, so particularly","in the infrared, and my main interest has been to try and","study the environment around the super massive black holes,","not as close as where the X-rays are coming from,","but clearly there's something from the X-ray corona","that illuminates the rest of the accretion disk,","and the dust that's further out.","And so fundamentally, that's one of the key things","that I'm trying to use, is trying to see how long,","once you've got this sort of pulse","that's generated close to the black hole,","it propagates out, and so you can use optical wavelengths","to see that the accretion disk lights up","in the optical a little bit as it gets heated up","from the X-ray, and then later on,","the infrared dust, the dust absorbs it,","and emits it in the infrared.","And so that, I love that, the ability","to exchange time for resolution,","because these structures are so far away","that we're never gonna get a telescope big enough","where that has the resolution to see the accretion disk,","or the dust distribution around--"],"779":["So do you get dimensions of the disk out of that?"],"745":["Yeah, again, we don't know exactly where X, Y, Z,","zero is, we're assuming that it's something,","you know, the X-rays that are coming out are very close","to the event horizon of the black hole,","but this is still, you know, your realm of X-rays,","to really figure out those kinds of things.","But once the X-rays, once the photons hit the corona,","and are re-scattered, and up, energized,","and then they start illuminating the accretion disk,","it heats it up, and so just by the light travel time,","when the optical, if it gets, you know,","brighter and fainter, and then the infrared gets brighter","and fainter, two weeks later,","then the dust is two light weeks away from that.","So it's a one dimensional one, so we're averaging,","so we don't get the two dimensional,","or even three dimensional one.","And then we've done it now, of course,","we have better telescopes, there was a project","where you could do it with the Hubble Space Telescope","and the ultraviolet, you used the Swift Observatory,","which had optical and ultraviolet,","and then from ground base, we did optical,","and then from space we did it","with Spitzer and the infrared.","So you could actually see this bright flash go off","in a nearby AGN called NGC5548,","and then you see it propagate as it warms up the disk,","as all that light is falling onto it,","and then eventually you hit the,","the, further away, where the dust is,","and the dust tends to radiate in an infrared.","So we got basically a structure,","and you just, you see this flashbulb go off,","and then it illuminates, effectively, the structure."],"780":["So you can map out the dust, where do you see it?"],"746":["So you do see it, basically the dust sublimation radius,","and you see it at, and it tells you,","depending on what kind of dust it is,","and it's actually one of the problems","for me studying, whenever we try and do X-ray studies","of low luminosity active galactic nuclei in your,","by galaxies, because there're all these X-ray binaries","that are also emitting X-rays,","which make our lives difficult.","But they're also in black holes,","when it's this really interesting sort of both,","it's great, but ugh, it's also a source","of noise for those of us who are trying","to do X-ray observations of nearby galaxies."],"781":["We have the same problem,","we can't see the actual black hole","underneath all these very bright X-ray binaries."],"747":["It's a weird thing to be sitting in your own galaxy,","but not be able to separate all these,","four million solar mass black hole creating,","next to, how massive, it's like two","to three solar masses for the X-ray binaries?"],"782":["The X-ray binaries, yeah, so they're,","no, they're typically like 10 solar masses, so from three,","you know, that's the smallest one you can have is","from three solar masses, and then all the way up.","So that's where we have LIGO, and LIGO has now directly,","I mean, this was all theory before,","that we knew that this was gonna happen,","and never seen it before, so LIGO is now the first time","that we have been able to completely verify this theory,","that you can have black holes","and neutron stars merging together.","And so what happens in the case","of two neutron stars, when they merge together,","now suddenly they become heavier,","they become heavy enough to turn into a black hole.","And so the first of these events happened in August,","and what happened here is you had these two neutron stars","that spun around each other, and then they merged,","and then for a very short time, we are talking","about 100 milliseconds, or tens of 100 milliseconds,","it actually remained a neutron star, probably,","it was a hyper massive neutron star because it was spinning","so fast, it didn't collapse under its own weight.","But then, you know,","the angular momentum gets dissipated away from the object,","and then, at that point, it can't maintain its own weight,","and then it collapses, and turn into a black hole.","All this theory that we knew about is now finally being,","being validated."],"748":["Which is great, although it still doesn't help us","in the AGN community, because we don't know how the millions","to billions solar mass black holes came to be.","But it's, at least we're building up,","or hopefully that at some point,","and by understanding these lower mass,","how these lower mass black holes came to be,","then we can see where there are a large scale number","of mergers can potentially give us this,","or you really need something, other,","another corridor to fundamentally get us something","that's a million solar masses, you know,","on the minimum side, but definitely,","you know, we've gotten those which are billion.","So we know we can merge the million solar mass black holes","to get the bigger ones, but how do you get to those","in the beginning, particularly so early in the universe,","when you get quasars at really high red shifts,","so they're really early on."],"783":["Yeah, it is odd, it is very odd.","I mean, the other thing that's a little odd,","now we're going back to stellar mass black holes is,","so we look at a lot of supernova remnants,","and we, so we see them, we can only really see them","in our own galaxy, and so we have a lot","of supernova remnants, and so how we see them is,","you see the expelled mass from the star as it died,","so that creates an extended source, and then you look","for the compact object that was left behind.","And what's interesting is that you see,","you quite often see the neutron stars","because they pulse, so they're easy to see,","but so far, we've not found a single black hole","at the center of a supernova remnant.","And so, which is interesting, so you say,","you should see them, you know, you ought","to see some fallback, you know, you need some matter,","you need something, but no, never, not yet been detected."],"749":["And this goes to the idea","that you don't have a core balance,","that a supernova with a black hole as its final result,","actually never has any kind of expulsion,","that it all just goes. (imitates sucking)"],"784":["Yeah, that might be, yeah."],"750":["Which was one idea, but again, it's,","I'll leave this to your theoreticians,","I think there are problems with that, as well.","I call it job security. That's right.","(both laugh)","We have a lot of things about black holes,","both in terms of their formation,","or even how they exist as they are,","and how they're interacting with their environment","that we're still not understanding."]},"turn_sentences":{"778":["So how do you do your observations in optical and infrared?"],"744":["So fortunately there's, I'm also doing it from space with the Spitzer Space Telescope, so particularly in the infrared, and my main interest has been to try and study the environment around the super massive black holes, not as close as where the X-rays are coming from, but clearly there's something from the X-ray corona that illuminates the rest of the accretion disk, and the dust that's further out.","And so fundamentally, that's one of the key things that I'm trying to use, is trying to see how long, once you've got this sort of pulse that's generated close to the black hole, it propagates out, and so you can use optical wavelengths to see that the accretion disk lights up in the optical a little bit as it gets heated up from the X-ray, and then later on, the infrared dust, the dust absorbs it, and emits it in the infrared.","And so that, I love that, the ability to exchange time for resolution, because these structures are so far away that we're never gonna get a telescope big enough where that has the resolution to see the accretion disk, or the dust distribution around--"],"779":["So do you get dimensions of the disk out of that?"],"745":["Yeah, again, we don't know exactly where X, Y, Z, zero is, we're assuming that it's something, you know, the X-rays that are coming out are very close to the event horizon of the black hole, but this is still, you know, your realm of X-rays, to really figure out those kinds of things.","But once the X-rays, once the photons hit the corona, and are re-scattered, and up, energized, and then they start illuminating the accretion disk, it heats it up, and so just by the light travel time, when the optical, if it gets, you know, brighter and fainter, and then the infrared gets brighter and fainter, two weeks later, then the dust is two light weeks away from that.","So it's a one dimensional one, so we're averaging, so we don't get the two dimensional, or even three dimensional one.","And then we've done it now, of course, we have better telescopes, there was a project where you could do it with the Hubble Space Telescope and the ultraviolet, you used the Swift Observatory, which had optical and ultraviolet, and then from ground base, we did optical, and then from space we did it with Spitzer and the infrared.","So you could actually see this bright flash go off in a nearby AGN called NGC5548, and then you see it propagate as it warms up the disk, as all that light is falling onto it, and then eventually you hit the, the, further away, where the dust is, and the dust tends to radiate in an infrared.","So we got basically a structure, and you just, you see this flashbulb go off, and then it illuminates, effectively, the structure."],"780":["So you can map out the dust, where do you see it?"],"746":["So you do see it, basically the dust sublimation radius, and you see it at, and it tells you, depending on what kind of dust it is, and it's actually one of the problems for me studying, whenever we try and do X-ray studies of low luminosity active galactic nuclei in your, by galaxies, because there're all these X-ray binaries that are also emitting X-rays, which make our lives difficult.","But they're also in black holes, when it's this really interesting sort of both, it's great, but ugh, it's also a source of noise for those of us who are trying to do X-ray observations of nearby galaxies."],"781":["We have the same problem, we can't see the actual black hole underneath all these very bright X-ray binaries."],"747":["It's a weird thing to be sitting in your own galaxy, but not be able to separate all these, four million solar mass black hole creating, next to, how massive, it's like two to three solar masses for the X-ray binaries?"],"782":["The X-ray binaries, yeah, so they're, no, they're typically like 10 solar masses, so from three, you know, that's the smallest one you can have is from three solar masses, and then all the way up.","So that's where we have LIGO, and LIGO has now directly, I mean, this was all theory before, that we knew that this was gonna happen, and never seen it before, so LIGO is now the first time that we have been able to completely verify this theory, that you can have black holes and neutron stars merging together.","And so what happens in the case of two neutron stars, when they merge together, now suddenly they become heavier, they become heavy enough to turn into a black hole.","And so the first of these events happened in August, and what happened here is you had these two neutron stars that spun around each other, and then they merged, and then for a very short time, we are talking about 100 milliseconds, or tens of 100 milliseconds, it actually remained a neutron star, probably, it was a hyper massive neutron star because it was spinning so fast, it didn't collapse under its own weight.","But then, you know, the angular momentum gets dissipated away from the object, and then, at that point, it can't maintain its own weight, and then it collapses, and turn into a black hole.","All this theory that we knew about is now finally being, being validated."],"748":["Which is great, although it still doesn't help us in the AGN community, because we don't know how the millions to billions solar mass black holes came to be.","But it's, at least we're building up, or hopefully that at some point, and by understanding these lower mass, how these lower mass black holes came to be, then we can see where there are a large scale number of mergers can potentially give us this, or you really need something, other, another corridor to fundamentally get us something that's a million solar masses, you know, on the minimum side, but definitely, you know, we've gotten those which are billion.","So we know we can merge the million solar mass black holes to get the bigger ones, but how do you get to those in the beginning, particularly so early in the universe, when you get quasars at really high red shifts, so they're really early on."],"783":["Yeah, it is odd, it is very odd.","I mean, the other thing that's a little odd, now we're going back to stellar mass black holes is, so we look at a lot of supernova remnants, and we, so we see them, we can only really see them in our own galaxy, and so we have a lot of supernova remnants, and so how we see them is, you see the expelled mass from the star as it died, so that creates an extended source, and then you look for the compact object that was left behind.","And what's interesting is that you see, you quite often see the neutron stars because they pulse, so they're easy to see, but so far, we've not found a single black hole at the center of a supernova remnant.","And so, which is interesting, so you say, you should see them, you know, you ought to see some fallback, you know, you need some matter, you need something, but no, never, not yet been detected."],"749":["And this goes to the idea that you don't have a core balance, that a supernova with a black hole as its final result, actually never has any kind of expulsion, that it all just goes.","(imitates sucking)"],"784":["Yeah, that might be, yeah."],"750":["Which was one idea, but again, it's, I'll leave this to your theoreticians, I think there are problems with that, as well.","I call it job security.","That's right.","(both laugh) We have a lot of things about black holes, both in terms of their formation, or even how they exist as they are, and how they're interacting with their environment that we're still not understanding."]},"turn_num_tokens":{"778":12,"744":228,"779":12,"745":344,"780":14,"746":129,"781":22,"747":49,"782":295,"748":185,"783":209,"749":45,"784":8,"750":85},"role":{"778":"Explainee","744":"Explainer","779":"Explainee","745":"Explainer","780":"Explainee","746":"Explainer","781":"Explainee","747":"Explainer","782":"Explainee","748":"Explainer","783":"Explainee","749":"Explainer","784":"Explainee","750":"Explainer"}}