{"topic":{"738":"blackhole","772":"blackhole","739":"blackhole","773":"blackhole","740":"blackhole","774":"blackhole","741":"blackhole","775":"blackhole","742":"blackhole","776":"blackhole","743":"blackhole","777":"blackhole"},"youtube_link":{"738":"https:\/\/youtu.be\/rUvFbJYWGDA?t=428","772":"https:\/\/youtu.be\/rUvFbJYWGDA","739":"https:\/\/youtu.be\/rUvFbJYWGDA?t=428","773":"https:\/\/youtu.be\/rUvFbJYWGDA","740":"https:\/\/youtu.be\/rUvFbJYWGDA?t=428","774":"https:\/\/youtu.be\/rUvFbJYWGDA","741":"https:\/\/youtu.be\/rUvFbJYWGDA?t=428","775":"https:\/\/youtu.be\/rUvFbJYWGDA","742":"https:\/\/youtu.be\/rUvFbJYWGDA?t=428","776":"https:\/\/youtu.be\/rUvFbJYWGDA","743":"https:\/\/youtu.be\/rUvFbJYWGDA?t=428","777":"https:\/\/youtu.be\/rUvFbJYWGDA"},"wired_link":{"738":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","772":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","739":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","773":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","740":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","774":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","741":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","775":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","742":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","776":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","743":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty","777":"https:\/\/www.wired.com\/video\/watch\/astronomer-explains-one-concept-in-5-levels-of-difficulty"},"dialog_lvl":{"738":"grad","772":"grad","739":"grad","773":"grad","740":"grad","774":"grad","741":"grad","775":"grad","742":"grad","776":"grad","743":"grad","777":"grad"},"dialog_id":{"738":"blackhole_6","772":"blackhole_6","739":"blackhole_6","773":"blackhole_6","740":"blackhole_6","774":"blackhole_6","741":"blackhole_6","775":"blackhole_6","742":"blackhole_6","776":"blackhole_6","743":"blackhole_6","777":"blackhole_6"},"speaker_id":{"738":1,"772":5,"739":1,"773":5,"740":1,"774":5,"741":1,"775":5,"742":1,"776":5,"743":1,"777":5},"reciever_id":{"738":5,"772":1,"739":5,"773":1,"740":5,"774":1,"741":5,"775":1,"742":5,"776":1,"743":5,"777":1},"turn_id":{"738":1,"772":2,"739":3,"773":4,"740":5,"774":6,"741":7,"775":8,"742":9,"776":10,"743":11,"777":12},"turn":{"738":["What got you interested in studying black holes?"],"772":["The way I got really interested","in this field is I actually first came","to Caltech as a summer student, and I started working","in this research group called the NuSTAR Group.","Right now I'm doing my PhD in the field","of active galactic nuclei,","which are the most luminous compact objects in the universe,","and it's because of the extreme accretion","that we're seeing onto these super massive black holes.","We don't have such a simple picture,","that this central black hole is surrounded","by this donut shaped torus of material,","and that all these different classes of AGN simply arise","from a viewing angle effect of this torus,","as a very oversimplified geometry, and this--"],"739":["Which is, by the way, what, when I was just starting out","in graduate school, that was the hot new thing, so."],"773":["Exactly."],"740":["That was, it was like, oh, wow, this might be it,","and then, but very early on, it was, as I just started my,","it was basically my second year of graduate school,","it was like, uh, this is not that simple."],"774":["It isn't."],"741":["You know, everybody's been just coming at it","from different wavelengths at the optical infrared,","and, but definitely the X-rays has been one","of those things where it's like, oh, finally."],"775":["And we've come a long way by seeing a wider range","of the spectrum, we can elucidate more","about the circumnuclear geometry,","and there's just been so much progress made","with all these new spectral models","that we use to fit AGN spectra,","and the different types of classes of AGN,","like type one and type two are believed","to be just a viewing angle effect","of seeing this torus at different angles."],"742":["It does seem to be that it may not even,","in parts, it may not be even connected","to this tiny, little torus at all","because part of the work that I did,","and others have done, is that type twos preferentially live","in different kinds of galaxies than type ones,","which should not in any way have to do","with something such a small scale.","They tend to be in smaller bulged,","SB and SC type spiral galaxies.","So there's something also having to do","with environment that gets you to be a type two,","and you can still maybe, timing wise,","but there's something else that's going on","on a larger scale because the type","of the AGN should not really correspond","to the host galaxy, but it seems to.","And that was one of the things","that we were finding out, and that was one","of the early little ideas that the,","individually, just as the torus model,","the unified model, can't explain everything","that we were observing at the time.","But it is one of those things that it's,","they're super luminous, they're all over the place,","and we don't have a really good picture of it,","which makes it exciting to study."],"776":["Yeah, and I think, you know,","pushing towards the future, that, like,","this whole multi-messenger era, and like,","you know, utilizing all the different wavelength telescopes","that we can is really the way to go.","We cannot just build up a picture purely","from X-rays alone, or purely from infrared,","and, you know, I think there should be increased effort","to try and have more coordinated observations","with the different telescopes, like NuSTAR--"],"743":["Oh, that makes sense, but it's always","so difficult to get that."],"777":["It is, and it's difficult to even just coordinate,","you know, soft X-ray and hard X-ray telescopes together,","like, getting, you know, time for both simultaneous,","you know, say, Chandra observations,","and NuSTAR observations, or (mumbles) and NuSTAR.","It's a difficult thing, but, you know,","I think we really need to get a clear picture,","to be looking at wavelengths, of course."]},"turn_sentences":{"738":["What got you interested in studying black holes?"],"772":["The way I got really interested in this field is I actually first came to Caltech as a summer student, and I started working in this research group called the NuSTAR Group.","Right now I'm doing my PhD in the field of active galactic nuclei, which are the most luminous compact objects in the universe, and it's because of the extreme accretion that we're seeing onto these super massive black holes.","We don't have such a simple picture, that this central black hole is surrounded by this donut shaped torus of material, and that all these different classes of AGN simply arise from a viewing angle effect of this torus, as a very oversimplified geometry, and this--"],"739":["Which is, by the way, what, when I was just starting out in graduate school, that was the hot new thing, so."],"773":["Exactly."],"740":["That was, it was like, oh, wow, this might be it, and then, but very early on, it was, as I just started my, it was basically my second year of graduate school, it was like, uh, this is not that simple."],"774":["It isn't."],"741":["You know, everybody's been just coming at it from different wavelengths at the optical infrared, and, but definitely the X-rays has been one of those things where it's like, oh, finally."],"775":["And we've come a long way by seeing a wider range of the spectrum, we can elucidate more about the circumnuclear geometry, and there's just been so much progress made with all these new spectral models that we use to fit AGN spectra, and the different types of classes of AGN, like type one and type two are believed to be just a viewing angle effect of seeing this torus at different angles."],"742":["It does seem to be that it may not even, in parts, it may not be even connected to this tiny, little torus at all because part of the work that I did, and others have done, is that type twos preferentially live in different kinds of galaxies than type ones, which should not in any way have to do with something such a small scale.","They tend to be in smaller bulged, SB and SC type spiral galaxies.","So there's something also having to do with environment that gets you to be a type two, and you can still maybe, timing wise, but there's something else that's going on on a larger scale because the type of the AGN should not really correspond to the host galaxy, but it seems to.","And that was one of the things that we were finding out, and that was one of the early little ideas that the, individually, just as the torus model, the unified model, can't explain everything that we were observing at the time.","But it is one of those things that it's, they're super luminous, they're all over the place, and we don't have a really good picture of it, which makes it exciting to study."],"776":["Yeah, and I think, you know, pushing towards the future, that, like, this whole multi-messenger era, and like, you know, utilizing all the different wavelength telescopes that we can is really the way to go.","We cannot just build up a picture purely from X-rays alone, or purely from infrared, and, you know, I think there should be increased effort to try and have more coordinated observations with the different telescopes, like NuSTAR--"],"743":["Oh, that makes sense, but it's always so difficult to get that."],"777":["It is, and it's difficult to even just coordinate, you know, soft X-ray and hard X-ray telescopes together, like, getting, you know, time for both simultaneous, you know, say, Chandra observations, and NuSTAR observations, or (mumbles) and NuSTAR.","It's a difficult thing, but, you know, I think we really need to get a clear picture, to be looking at wavelengths, of course."]},"turn_num_tokens":{"738":9,"772":131,"739":28,"773":2,"740":55,"774":4,"741":39,"775":80,"742":240,"776":90,"743":16,"777":85},"role":{"738":"Explainer","772":"Explainee","739":"Explainer","773":"Explainee","740":"Explainer","774":"Explainee","741":"Explainer","775":"Explainee","742":"Explainer","776":"Explainee","743":"Explainer","777":"Explainee"}}