{"topic":{"19":"blockchain","66":"blockchain","20":"blockchain","67":"blockchain","21":"blockchain","68":"blockchain","22":"blockchain","69":"blockchain","23":"blockchain"},"youtube_link":{"19":"https:\/\/youtu.be\/hYip_Vuv8J0?t=224","66":"https:\/\/youtu.be\/hYip_Vuv8J0","20":"https:\/\/youtu.be\/hYip_Vuv8J0?t=224","67":"https:\/\/youtu.be\/hYip_Vuv8J0","21":"https:\/\/youtu.be\/hYip_Vuv8J0?t=224","68":"https:\/\/youtu.be\/hYip_Vuv8J0","22":"https:\/\/youtu.be\/hYip_Vuv8J0?t=224","69":"https:\/\/youtu.be\/hYip_Vuv8J0","23":"https:\/\/youtu.be\/hYip_Vuv8J0?t=224"},"wired_link":{"19":"https:\/\/www.wired.com\/video\/watch\/expert-explains-one-concept-in-5-levels-of-difficulty-blockchain","66":"https:\/\/www.wired.com\/video\/watch\/expert-explains-one-concept-in-5-levels-of-difficulty-blockchain","20":"https:\/\/www.wired.com\/video\/watch\/expert-explains-one-concept-in-5-levels-of-difficulty-blockchain","67":"https:\/\/www.wired.com\/video\/watch\/expert-explains-one-concept-in-5-levels-of-difficulty-blockchain","21":"https:\/\/www.wired.com\/video\/watch\/expert-explains-one-concept-in-5-levels-of-difficulty-blockchain","68":"https:\/\/www.wired.com\/video\/watch\/expert-explains-one-concept-in-5-levels-of-difficulty-blockchain","22":"https:\/\/www.wired.com\/video\/watch\/expert-explains-one-concept-in-5-levels-of-difficulty-blockchain","69":"https:\/\/www.wired.com\/video\/watch\/expert-explains-one-concept-in-5-levels-of-difficulty-blockchain","23":"https:\/\/www.wired.com\/video\/watch\/expert-explains-one-concept-in-5-levels-of-difficulty-blockchain"},"dialog_lvl":{"19":"undergrad","66":"undergrad","20":"undergrad","67":"undergrad","21":"undergrad","68":"undergrad","22":"undergrad","69":"undergrad","23":"undergrad"},"dialog_id":{"19":"blockchain_5","66":"blockchain_5","20":"blockchain_5","67":"blockchain_5","21":"blockchain_5","68":"blockchain_5","22":"blockchain_5","69":"blockchain_5","23":"blockchain_5"},"speaker_id":{"19":1,"66":4,"20":1,"67":4,"21":1,"68":4,"22":1,"69":4,"23":1},"reciever_id":{"19":4,"66":1,"20":4,"67":1,"21":4,"68":1,"22":4,"69":1,"23":4},"turn_id":{"19":1,"66":2,"20":3,"67":4,"21":5,"68":6,"22":7,"69":8,"23":9},"turn":{"19":["We're gonna talk about blockchain technology.","Have you heard of blockchain?"],"66":["I've heard of the words blockchain,","but I'm not sure I know what it is."],"20":["When we were much smaller societies,","you and I could trade in our community pretty easily.","As the distance in our trade grew,","we ended up inventing institutions, right?","If you Uber or you use Airbnb or you use Amazon even,","these are just digital marketplaces and platforms","that help us facilitate an exchange of value.","But today, we actually have a technology","that allows us to trade one to one but at scale,","and it's called blockchain technology.","There is some kind of interface for it.","You could have an app, or you could use a computer","to do it, but instead of there being a company","in the middle that's helping you make that transaction,","it's a bunch of software code."],"67":["Okay."],"21":["And so it's being run by all of these different computers","that have like a node.","So they're all running the same software","and guaranteeing your transactions as they happen."],"68":["I mean, I would assume this technology","is taking away business or activity from these middlemen."],"22":["In some cases, yeah, it is.","And a lot of people in the financial industry,","in particular, are looking at it from the banking side","of how do we use this technology to trade things","like Bitcoin or other tokens that are easier to use","instead of today's currency.","A lot of people think about blockchain as Bitcoin","because it's sort of in the news a lot,","and it's this new cryptocurrency.","And it's kind of exciting.","But we're actually seeing a lot more use cases","for blockchain that aren't around the currency side.","They're more around, how do you take any asset","and be able to trade that using this same technology."],"69":["Is there a mechanism for verifying that person A","is a legitimate seller or producer of the item?"],"23":["So today, a lot of people are working on how to create","identity structures that leverage blockchains.","And one of the tools for doing that is being able","to cryptographically sign for a given attribute.","So your government could sign that you have a US passport","or a university could sign that you are","a currently enrolled student.","And you could then dole out that information","and control it yourself and be able to show people","those certifications on an as needed basis."]},"turn_sentences":{"19":["We're gonna talk about blockchain technology.","Have you heard of blockchain?"],"66":["I've heard of the words blockchain, but I'm not sure I know what it is."],"20":["When we were much smaller societies, you and I could trade in our community pretty easily.","As the distance in our trade grew, we ended up inventing institutions, right?","If you Uber or you use Airbnb or you use Amazon even, these are just digital marketplaces and platforms that help us facilitate an exchange of value.","But today, we actually have a technology that allows us to trade one to one but at scale, and it's called blockchain technology.","There is some kind of interface for it.","You could have an app, or you could use a computer to do it, but instead of there being a company in the middle that's helping you make that transaction, it's a bunch of software code."],"67":["Okay."],"21":["And so it's being run by all of these different computers that have like a node.","So they're all running the same software and guaranteeing your transactions as they happen."],"68":["I mean, I would assume this technology is taking away business or activity from these middlemen."],"22":["In some cases, yeah, it is.","And a lot of people in the financial industry, in particular, are looking at it from the banking side of how do we use this technology to trade things like Bitcoin or other tokens that are easier to use instead of today's currency.","A lot of people think about blockchain as Bitcoin because it's sort of in the news a lot, and it's this new cryptocurrency.","And it's kind of exciting.","But we're actually seeing a lot more use cases for blockchain that aren't around the currency side.","They're more around, how do you take any asset and be able to trade that using this same technology."],"69":["Is there a mechanism for verifying that person A is a legitimate seller or producer of the item?"],"23":["So today, a lot of people are working on how to create identity structures that leverage blockchains.","And one of the tools for doing that is being able to cryptographically sign for a given attribute.","So your government could sign that you have a US passport or a university could sign that you are a currently enrolled student.","And you could then dole out that information and control it yourself and be able to show people those certifications on an as needed basis."]},"turn_num_tokens":{"19":15,"66":19,"20":141,"67":2,"21":34,"68":18,"22":132,"69":19,"23":88},"role":{"19":"Explainer","66":"Explainee","20":"Explainer","67":"Explainee","21":"Explainer","68":"Explainee","22":"Explainer","69":"Explainee","23":"Explainer"}}