{"topic":{"1492":"hacking","1544":"hacking","1493":"hacking","1545":"hacking","1494":"hacking","1546":"hacking","1495":"hacking","1547":"hacking","1496":"hacking","1548":"hacking","1497":"hacking","1549":"hacking","1498":"hacking","1550":"hacking","1499":"hacking","1551":"hacking","1500":"hacking","1552":"hacking","1501":"hacking"},"youtube_link":{"1492":"https:\/\/youtu.be\/d9PqVcgT1kQ?t=352","1544":"https:\/\/youtu.be\/d9PqVcgT1kQ","1493":"https:\/\/youtu.be\/d9PqVcgT1kQ?t=352","1545":"https:\/\/youtu.be\/d9PqVcgT1kQ","1494":"https:\/\/youtu.be\/d9PqVcgT1kQ?t=352","1546":"https:\/\/youtu.be\/d9PqVcgT1kQ","1495":"https:\/\/youtu.be\/d9PqVcgT1kQ?t=352","1547":"https:\/\/youtu.be\/d9PqVcgT1kQ","1496":"https:\/\/youtu.be\/d9PqVcgT1kQ?t=352","1548":"https:\/\/youtu.be\/d9PqVcgT1kQ","1497":"https:\/\/youtu.be\/d9PqVcgT1kQ?t=352","1549":"https:\/\/youtu.be\/d9PqVcgT1kQ","1498":"https:\/\/youtu.be\/d9PqVcgT1kQ?t=352","1550":"https:\/\/youtu.be\/d9PqVcgT1kQ","1499":"https:\/\/youtu.be\/d9PqVcgT1kQ?t=352","1551":"https:\/\/youtu.be\/d9PqVcgT1kQ","1500":"https:\/\/youtu.be\/d9PqVcgT1kQ?t=352","1552":"https:\/\/youtu.be\/d9PqVcgT1kQ","1501":"https:\/\/youtu.be\/d9PqVcgT1kQ?t=352"},"wired_link":{"1492":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1544":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1493":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1545":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1494":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1546":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1495":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1547":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1496":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1548":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1497":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1549":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1498":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1550":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1499":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1551":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1500":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1552":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty","1501":"https:\/\/www.wired.com\/video\/watch\/5-levels-hacker-explains-one-concept-in-5-levels-of-difficulty"},"dialog_lvl":{"1492":"undergrad","1544":"undergrad","1493":"undergrad","1545":"undergrad","1494":"undergrad","1546":"undergrad","1495":"undergrad","1547":"undergrad","1496":"undergrad","1548":"undergrad","1497":"undergrad","1549":"undergrad","1498":"undergrad","1550":"undergrad","1499":"undergrad","1551":"undergrad","1500":"undergrad","1552":"undergrad","1501":"undergrad"},"dialog_id":{"1492":"hacking_5","1544":"hacking_5","1493":"hacking_5","1545":"hacking_5","1494":"hacking_5","1546":"hacking_5","1495":"hacking_5","1547":"hacking_5","1496":"hacking_5","1548":"hacking_5","1497":"hacking_5","1549":"hacking_5","1498":"hacking_5","1550":"hacking_5","1499":"hacking_5","1551":"hacking_5","1500":"hacking_5","1552":"hacking_5","1501":"hacking_5"},"speaker_id":{"1492":1,"1544":4,"1493":1,"1545":4,"1494":1,"1546":4,"1495":1,"1547":4,"1496":1,"1548":4,"1497":1,"1549":4,"1498":1,"1550":4,"1499":1,"1551":4,"1500":1,"1552":4,"1501":1},"reciever_id":{"1492":4,"1544":1,"1493":4,"1545":1,"1494":4,"1546":1,"1495":4,"1547":1,"1496":4,"1548":1,"1497":4,"1549":1,"1498":4,"1550":1,"1499":4,"1551":1,"1500":4,"1552":1,"1501":4},"turn_id":{"1492":1,"1544":2,"1493":3,"1545":4,"1494":5,"1546":6,"1495":7,"1547":8,"1496":9,"1548":10,"1497":11,"1549":12,"1498":13,"1550":14,"1499":15,"1551":16,"1500":17,"1552":18,"1501":19},"turn":{"1492":["Have you started studying cybersecurity?"],"1544":["I started this year, I took my first course,","so haven't gone too deep into it,","but we got a basic idea of, like,","basics of information and network security.","We learned about how networks are set up,","like the different types of topologies, like Star and Mesh,","and also how networks are designed","with different levels of security."],"1493":["Have you heard of the breach of Target","where they were breached many years ago","and their point of sale systems were hacked?"],"1545":["Yes, I heard about that."],"1494":["So where people are swiping credit cards,","those credit card numbers were stolen.","They hired a company to come in","and perform a penetration test to see,","can the good guys essentially break in again","to prevent this sort of thing in the future?","And when this team came in,","they found they actually were able","to get pretty much to the same point of sale system,","and the way they did that was by exploiting","an internet-connected deli meat scale.","Once the company was able to essentially","get into the deli scale,","because the deli scale was on the internal network,","then they were able to really escalate privilege and find","a vulnerability within another system.","Essentially, that just got them into the network.","and once you're in the network,","it's often really easy to then escalate from there."],"1546":["I've heard about similar attacks","in hospitals using hospital equipment,","but I'm surprised that something as simple as a meat scale","would have been used in such an attack.","We discussed it in class as how hackers look at","some of the weakest links in these large networks","and use those to tap into networks."],"1495":["Yeah, that's another interesting concept.","It's really just different layers","that we have for protection,","because often when you're talking about","something like a corporate network,","or even your home network,","you typically have sort of one level of defense, right?","If someone can break that","or it can get in through some other system","that is connected or exposes","some other protocol, like Bluetooth, right?","You can connect to a Bluetooth device","without being on the wireless network,","without being on the LAN.","That potentially gives you another place","that you can pivot on and then access other devices,","because if something has both Bluetooth and also Wi-Fi,","well, if you can get in through Bluetooth,","then you can then access the Wi-Fi","and get to other devices on the network.","Are you familiar with buffer overflows?"],"1547":["No, I am not familiar with that."],"1496":["If we were to write a program that asked for your name","and you typed in your name,","but before you could type in your name,","in a low leveling, which is like C or C++,","you'd have to allocate some memory.","So you might allocate a buffer of a hundred bytes","because whose name is going to be longer","than a hundred bytes or a hundred character?","But what happens if you were to not really check","that they limited to a hundred bytes?","Do you know what happens if they essentially","start typing over that hundred bytes?"],"1548":["In that case,","it would be an error for accessing invalid memory."],"1497":["Absolutely, you would essentially cause","a segmentation fault."],"1549":["Yeah."],"1498":["But what's really cool about that is,","when you're going into memory,","you're starting to cross over","that boundary of that hundred byte allocation,","and now you're starting to write over additional memory.","That other memory is really important stuff.","So you have your name, the hundred bytes there,","and then right next to your name is the return address,","and that's the address that the code is gonna execute","and it's going to return to after that function is done,","and it's going to jump to that address,","but after you type your hundred bytes,","the next few bites that you type,","you're actually going to overwrite that return address.","So that return address could essentially be","another address in memory.","So what you end up doing is you type a name","and it's not really a name, it's really just code.","And that code, you keep typing until","you get to the return address,","and you start typing an address,","which is really the beginning of your name","and your computer or your processor","is actually going to read that address","and it will jump back to the beginning","and then execute that payload.","So that was sort of the very first thing that I think was","super exciting to me when I started","learning about really reverse engineering."],"1550":["So how does the buffer overloading","relate to what you are doing in terms of","network security or designing software","for penetration testing?"],"1499":["Ever since buffer overflow started many years ago,","there been a lot of protection mechanisms","built to make it difficult to exploit.","More and more, we're actually using","smaller and smaller computers","with smaller amounts of compute power.","If you take a car, you have hundreds of microcontrollers","that are all running there.","So they don't really have a sophisticated operating system","that can try to prevent attacks like buffer overflows.","So how do we keep these low cost computers in here while","adding layers of protection to prevent malice","and these types of attacks?","Sometimes it actually is,","how can we write software","or how can we build a system","that prevents these types of attacks from entering?","But oftentimes, it's really looking for how can we find","new attacks that we haven't even necessarily thought of?","What got you interested in computer science","and information security?"],"1551":["I got interested in cybersecurity","because I'm really into global affairs, global politics,","and you often hear in the news about","the rising power of China, the rising power of Iran.","I enjoy how interdisciplinary computer science is.","Like, nowadays there's so much going on","in the world of computers and that's what fascinated me."],"1500":["You brought up China and Iran,","and something that's interesting about those areas","is really censorship, right?","They have essentially censored internet.","In the US, we have a really interesting","internal struggle here where we actually have","government agencies like the state department","that are funding software to evade censorship,","like Tor and other mechanisms.","While then we also have an internal struggle where we have","other organizations like the NSA","who are specifically looking to break that exact same system","that the US government is also funding."],"1552":["There are a lot of ethical questions","about whether we should be intervening in other countries,","but it's pretty interesting that","two different agencies of the government","are actually working on contrasting technology.","I can actually understand that because","if we are creating a technology","that we are going to deploy somewhere else,","we should know its limitations.","We should know how to control it."],"1501":["It's good for us to understand","how these systems can really break down.","Although, I think one thing that I see","is that some of, let's say,","the organizations that are looking to break this","are not necessarily going to share","once they actually learn that information.","They might actually sort of hold that in their back pocket","and use it when it's advantageous to them."]},"turn_sentences":{"1492":["Have you started studying cybersecurity?"],"1544":["I started this year, I took my first course, so haven't gone too deep into it, but we got a basic idea of, like, basics of information and network security.","We learned about how networks are set up, like the different types of topologies, like Star and Mesh, and also how networks are designed with different levels of security."],"1493":["Have you heard of the breach of Target where they were breached many years ago and their point of sale systems were hacked?"],"1545":["Yes, I heard about that."],"1494":["So where people are swiping credit cards, those credit card numbers were stolen.","They hired a company to come in and perform a penetration test to see, can the good guys essentially break in again to prevent this sort of thing in the future?","And when this team came in, they found they actually were able to get pretty much to the same point of sale system, and the way they did that was by exploiting an internet-connected deli meat scale.","Once the company was able to essentially get into the deli scale, because the deli scale was on the internal network, then they were able to really escalate privilege and find a vulnerability within another system.","Essentially, that just got them into the network.","and once you're in the network, it's often really easy to then escalate from there."],"1546":["I've heard about similar attacks in hospitals using hospital equipment, but I'm surprised that something as simple as a meat scale would have been used in such an attack.","We discussed it in class as how hackers look at some of the weakest links in these large networks and use those to tap into networks."],"1495":["Yeah, that's another interesting concept.","It's really just different layers that we have for protection, because often when you're talking about something like a corporate network, or even your home network, you typically have sort of one level of defense, right?","If someone can break that or it can get in through some other system that is connected or exposes some other protocol, like Bluetooth, right?","You can connect to a Bluetooth device without being on the wireless network, without being on the LAN.","That potentially gives you another place that you can pivot on and then access other devices, because if something has both Bluetooth and also Wi-Fi, well, if you can get in through Bluetooth, then you can then access the Wi-Fi and get to other devices on the network.","Are you familiar with buffer overflows?"],"1547":["No, I am not familiar with that."],"1496":["If we were to write a program that asked for your name and you typed in your name, but before you could type in your name, in a low leveling, which is like C or C++, you'd have to allocate some memory.","So you might allocate a buffer of a hundred bytes because whose name is going to be longer than a hundred bytes or a hundred character?","But what happens if you were to not really check that they limited to a hundred bytes?","Do you know what happens if they essentially start typing over that hundred bytes?"],"1548":["In that case, it would be an error for accessing invalid memory."],"1497":["Absolutely, you would essentially cause a segmentation fault."],"1549":["Yeah."],"1498":["But what's really cool about that is, when you're going into memory, you're starting to cross over that boundary of that hundred byte allocation, and now you're starting to write over additional memory.","That other memory is really important stuff.","So you have your name, the hundred bytes there, and then right next to your name is the return address, and that's the address that the code is gonna execute and it's going to return to after that function is done, and it's going to jump to that address, but after you type your hundred bytes, the next few bites that you type, you're actually going to overwrite that return address.","So that return address could essentially be another address in memory.","So what you end up doing is you type a name and it's not really a name, it's really just code.","And that code, you keep typing until you get to the return address, and you start typing an address, which is really the beginning of your name and your computer or your processor is actually going to read that address and it will jump back to the beginning and then execute that payload.","So that was sort of the very first thing that I think was super exciting to me when I started learning about really reverse engineering."],"1550":["So how does the buffer overloading relate to what you are doing in terms of network security or designing software for penetration testing?"],"1499":["Ever since buffer overflow started many years ago, there been a lot of protection mechanisms built to make it difficult to exploit.","More and more, we're actually using smaller and smaller computers with smaller amounts of compute power.","If you take a car, you have hundreds of microcontrollers that are all running there.","So they don't really have a sophisticated operating system that can try to prevent attacks like buffer overflows.","So how do we keep these low cost computers in here while adding layers of protection to prevent malice and these types of attacks?","Sometimes it actually is, how can we write software or how can we build a system that prevents these types of attacks from entering?","But oftentimes, it's really looking for how can we find new attacks that we haven't even necessarily thought of?","What got you interested in computer science and information security?"],"1551":["I got interested in cybersecurity because I'm really into global affairs, global politics, and you often hear in the news about the rising power of China, the rising power of Iran.","I enjoy how interdisciplinary computer science is.","Like, nowadays there's so much going on in the world of computers and that's what fascinated me."],"1500":["You brought up China and Iran, and something that's interesting about those areas is really censorship, right?","They have essentially censored internet.","In the US, we have a really interesting internal struggle here where we actually have government agencies like the state department that are funding software to evade censorship, like Tor and other mechanisms.","While then we also have an internal struggle where we have other organizations like the NSA who are specifically looking to break that exact same system that the US government is also funding."],"1552":["There are a lot of ethical questions about whether we should be intervening in other countries, but it's pretty interesting that two different agencies of the government are actually working on contrasting technology.","I can actually understand that because if we are creating a technology that we are going to deploy somewhere else, we should know its limitations.","We should know how to control it."],"1501":["It's good for us to understand how these systems can really break down.","Although, I think one thing that I see is that some of, let's say, the organizations that are looking to break this are not necessarily going to share once they actually learn that information.","They might actually sort of hold that in their back pocket and use it when it's advantageous to them."]},"turn_num_tokens":{"1492":6,"1544":70,"1493":24,"1545":7,"1494":156,"1546":60,"1495":159,"1547":9,"1496":108,"1548":14,"1497":10,"1549":2,"1498":253,"1550":24,"1499":165,"1551":65,"1500":97,"1552":71,"1501":75},"role":{"1492":"Explainer","1544":"Explainee","1493":"Explainer","1545":"Explainee","1494":"Explainer","1546":"Explainee","1495":"Explainer","1547":"Explainee","1496":"Explainer","1548":"Explainee","1497":"Explainer","1549":"Explainee","1498":"Explainer","1550":"Explainee","1499":"Explainer","1551":"Explainee","1500":"Explainer","1552":"Explainee","1501":"Explainer"}}