{"topic":{"818":"lasers","889":"lasers","819":"lasers","890":"lasers","820":"lasers","891":"lasers","821":"lasers","892":"lasers","822":"lasers","893":"lasers","823":"lasers","894":"lasers","824":"lasers","895":"lasers"},"youtube_link":{"818":"https:\/\/youtu.be\/3eTogq7rknQ?t=549","889":"https:\/\/youtu.be\/3eTogq7rknQ","819":"https:\/\/youtu.be\/3eTogq7rknQ?t=549","890":"https:\/\/youtu.be\/3eTogq7rknQ","820":"https:\/\/youtu.be\/3eTogq7rknQ?t=549","891":"https:\/\/youtu.be\/3eTogq7rknQ","821":"https:\/\/youtu.be\/3eTogq7rknQ?t=549","892":"https:\/\/youtu.be\/3eTogq7rknQ","822":"https:\/\/youtu.be\/3eTogq7rknQ?t=549","893":"https:\/\/youtu.be\/3eTogq7rknQ","823":"https:\/\/youtu.be\/3eTogq7rknQ?t=549","894":"https:\/\/youtu.be\/3eTogq7rknQ","824":"https:\/\/youtu.be\/3eTogq7rknQ?t=549","895":"https:\/\/youtu.be\/3eTogq7rknQ"},"wired_link":{"818":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","889":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","819":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","890":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","820":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","891":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","821":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","892":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","822":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","893":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","823":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","894":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","824":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty","895":"https:\/\/www.wired.com\/video\/watch\/professor-explains-one-concept-in-5-levels-of-difficulty"},"dialog_lvl":{"818":"undergrad","889":"undergrad","819":"undergrad","890":"undergrad","820":"undergrad","891":"undergrad","821":"undergrad","892":"undergrad","822":"undergrad","893":"undergrad","823":"undergrad","894":"undergrad","824":"undergrad","895":"undergrad"},"dialog_id":{"818":"lasers_5","889":"lasers_5","819":"lasers_5","890":"lasers_5","820":"lasers_5","891":"lasers_5","821":"lasers_5","892":"lasers_5","822":"lasers_5","893":"lasers_5","823":"lasers_5","894":"lasers_5","824":"lasers_5","895":"lasers_5"},"speaker_id":{"818":1,"889":4,"819":1,"890":4,"820":1,"891":4,"821":1,"892":4,"822":1,"893":4,"823":1,"894":4,"824":1,"895":4},"reciever_id":{"818":4,"889":1,"819":4,"890":1,"820":4,"891":1,"821":4,"892":1,"822":4,"893":1,"823":4,"894":1,"824":4,"895":1},"turn_id":{"818":1,"889":2,"819":3,"890":4,"820":5,"891":6,"821":7,"892":8,"822":9,"893":10,"823":11,"894":12,"824":13,"895":14},"turn":{"818":["[Donna] So you're a college student?"],"889":["Yes."],"819":["[Donna] And what's your major?"],"890":["I'm an engineering physics major with a minor in math.","I'm in the three, two program for biomedical engineering."],"820":["Excellent.","I got an engineering physics degree.","There you go, something in common.","We're here today talking about lasers.","So have you have had much exposure to lasers yet at school?"],"891":["Not yet.","I'm really hoping that we will.","I think it's super interesting just the field","in general because I really do enjoy examining","all the calculations and being able to do","a little bit more of the math side of physics."],"821":["Okay.","As opposed to the experimental side and seeing things?","Okay so I'm much more, I like to see the things happening.","So then the question is, what's so special","about making a light that's intense enough","to actually possibly blow things up?","Certainly we can blow atoms up with the laser hammer","and when the laser light comes in","and just smacks the electrons right off the atom.","And so the question really is how do you make that?","Back in the 70s and into the 80s, I know that was","a long time ago for you, we had big energy lasers","and we had short pulse lasers, we","couldn't have big energy, short pulse lasers","and actually it was my supervisor and I","that figured the way around that and we got","something called chirped pulse amplification.","Have you heard of chirped pulse amplification by any chance?"],"892":["Vaguely."],"822":["Well I brought a little bit of a prop","to explain how chirped pulse amplification works.","Our short pulses are made of different colors.","So I've got a colored slinky here.","We probably could've called it stretched pulse amplification","but that's kind of boring so we used the word chirped.","The word chirped comes around because birds chirp.","When the birds are singing, the notes are actually","changing audio frequency with time and that's a chirp.","The point is is that when all the light is","squeezed together like this, it's a short pulse.","And that's when it's a hammer because all","of the light is now concentrated and you can imagine if this","was coming along and also using a lens to focus it small,","then all of that light at the focal spot, concentrate.","And so that was the laser hammer.","So we can't have that in the laser.","So the question is what could we do?","The fact that it's different colors","and different colors because of dispersion,","travel different speeds inside material.","So we used a long fiber, 1.4 kilometers of fiber","but, in fiber, the red colors really haven't got","that much in common with the glass atoms and so they","spend very little time interacting and they travel fast.","The red is going to start traveling faster than the green,","faster than the blue and, as you travel down the fiber,","next thing you know, you have a long pulse","and it's chirped from red at the","beginning to blue at the back.","And so the frequencies go hoo!","Like this okay?","So this is a chirped pulse and now it's a long pulse.","And so, first this is what we did, we chirped it,","we stretched it, then we can safely amplify it","because it's not all concentrated","and, after we amplify it, then we use something called","a compressor and we put all of the colors back together","and it was back being a short pulse but a high energy pulse.","And then we really had what I like to call a laser hammer.","When this laser pulse goes inside,","it smacks those electrons right off the atom."],"893":["So the laser hammer that you were describing with","other types of lasers and the one in","the chirped is it still the same premise?"],"823":["Well a lot of lasers and when lasers","first came along, they were only single color.","Your cat toy, would only be a single color,","probably a red one and so that's just one color.","And one color means that it has to","really be there for the whole time.","One color is one wave length of light","and so it's just one wave that goes on and on and on.","If you want a short pulse, you","actually have to have all the colors.","And if you can imagine that one point in time,","and I like to say it's like a conductor of an orchestra.","When you're listening to an orchestra warm up, they","sound terrible, they're all playing their own notes.","But when the conductor conducts them, they all play","different notes but, together, it's beautiful music.","So we have something in the laser called a mode locker","and it's like the conductor and it says go now.","And all the colors will start together but","some colors are long wave length and others are shorter.","So next thing you know, you have peaks","meeting valleys and they cancel each other.","And the more colors you can bring in, the faster","that happens and the shorter the pulse you can make."],"894":["What's the pendant?"],"824":["The necklace is something that","was designed for my Nobel prize.","It's sold at the Nobel museum and it is a chirped pulse.","So we've been talking a lot about lasers and applications,","what have you learned about chirped pulses?"],"895":["I learned that it all stretches, which is super cool,","because red moves the fastest","and so it kinda tugs around blue.","It really threw me off just how fast.","It's hard to imagine things happening that fast.","And I also learned how many of the things","that I know are lasers.","Like how many of the things that I've been looking for,","like, the answers to, it is in lasers."]},"turn_sentences":{"818":["[Donna] So you're a college student?"],"889":["Yes."],"819":["[Donna] And what's your major?"],"890":["I'm an engineering physics major with a minor in math.","I'm in the three, two program for biomedical engineering."],"820":["Excellent.","I got an engineering physics degree.","There you go, something in common.","We're here today talking about lasers.","So have you have had much exposure to lasers yet at school?"],"891":["Not yet.","I'm really hoping that we will.","I think it's super interesting just the field in general because I really do enjoy examining all the calculations and being able to do a little bit more of the math side of physics."],"821":["Okay.","As opposed to the experimental side and seeing things?","Okay so I'm much more, I like to see the things happening.","So then the question is, what's so special about making a light that's intense enough to actually possibly blow things up?","Certainly we can blow atoms up with the laser hammer and when the laser light comes in and just smacks the electrons right off the atom.","And so the question really is how do you make that?","Back in the 70s and into the 80s, I know that was a long time ago for you, we had big energy lasers and we had short pulse lasers, we couldn't have big energy, short pulse lasers and actually it was my supervisor and I that figured the way around that and we got something called chirped pulse amplification.","Have you heard of chirped pulse amplification by any chance?"],"892":["Vaguely."],"822":["Well I brought a little bit of a prop to explain how chirped pulse amplification works.","Our short pulses are made of different colors.","So I've got a colored slinky here.","We probably could've called it stretched pulse amplification but that's kind of boring so we used the word chirped.","The word chirped comes around because birds chirp.","When the birds are singing, the notes are actually changing audio frequency with time and that's a chirp.","The point is is that when all the light is squeezed together like this, it's a short pulse.","And that's when it's a hammer because all of the light is now concentrated and you can imagine if this was coming along and also using a lens to focus it small, then all of that light at the focal spot, concentrate.","And so that was the laser hammer.","So we can't have that in the laser.","So the question is what could we do?","The fact that it's different colors and different colors because of dispersion, travel different speeds inside material.","So we used a long fiber, 1.4 kilometers of fiber but, in fiber, the red colors really haven't got that much in common with the glass atoms and so they spend very little time interacting and they travel fast.","The red is going to start traveling faster than the green, faster than the blue and, as you travel down the fiber, next thing you know, you have a long pulse and it's chirped from red at the beginning to blue at the back.","And so the frequencies go hoo!","Like this okay?","So this is a chirped pulse and now it's a long pulse.","And so, first this is what we did, we chirped it, we stretched it, then we can safely amplify it because it's not all concentrated and, after we amplify it, then we use something called a compressor and we put all of the colors back together and it was back being a short pulse but a high energy pulse.","And then we really had what I like to call a laser hammer.","When this laser pulse goes inside, it smacks those electrons right off the atom."],"893":["So the laser hammer that you were describing with other types of lasers and the one in the chirped is it still the same premise?"],"823":["Well a lot of lasers and when lasers first came along, they were only single color.","Your cat toy, would only be a single color, probably a red one and so that's just one color.","And one color means that it has to really be there for the whole time.","One color is one wave length of light and so it's just one wave that goes on and on and on.","If you want a short pulse, you actually have to have all the colors.","And if you can imagine that one point in time, and I like to say it's like a conductor of an orchestra.","When you're listening to an orchestra warm up, they sound terrible, they're all playing their own notes.","But when the conductor conducts them, they all play different notes but, together, it's beautiful music.","So we have something in the laser called a mode locker and it's like the conductor and it says go now.","And all the colors will start together but some colors are long wave length and others are shorter.","So next thing you know, you have peaks meeting valleys and they cancel each other.","And the more colors you can bring in, the faster that happens and the shorter the pulse you can make."],"894":["What's the pendant?"],"824":["The necklace is something that was designed for my Nobel prize.","It's sold at the Nobel museum and it is a chirped pulse.","So we've been talking a lot about lasers and applications, what have you learned about chirped pulses?"],"895":["I learned that it all stretches, which is super cool, because red moves the fastest and so it kinda tugs around blue.","It really threw me off just how fast.","It's hard to imagine things happening that fast.","And I also learned how many of the things that I know are lasers.","Like how many of the things that I've been looking for, like, the answers to, it is in lasers."]},"turn_num_tokens":{"818":10,"889":2,"819":9,"890":24,"820":38,"891":47,"821":167,"892":2,"822":418,"893":26,"823":245,"894":5,"824":46,"895":83},"role":{"818":"Explainer","889":"Explainee","819":"Explainer","890":"Explainee","820":"Explainer","891":"Explainee","821":"Explainer","892":"Explainee","822":"Explainer","893":"Explainee","823":"Explainer","894":"Explainee","824":"Explainer","895":"Explainee"}}