{"topic":{"1280":"machine_learning","1220":"machine_learning","1281":"machine_learning","1221":"machine_learning","1282":"machine_learning","1222":"machine_learning","1283":"machine_learning","1223":"machine_learning","1284":"machine_learning","1224":"machine_learning","1285":"machine_learning","1225":"machine_learning","1286":"machine_learning","1226":"machine_learning"},"youtube_link":{"1280":"https:\/\/youtu.be\/5q87K1WaoFI","1220":"https:\/\/youtu.be\/5q87K1WaoFI?t=892","1281":"https:\/\/youtu.be\/5q87K1WaoFI","1221":"https:\/\/youtu.be\/5q87K1WaoFI?t=892","1282":"https:\/\/youtu.be\/5q87K1WaoFI","1222":"https:\/\/youtu.be\/5q87K1WaoFI?t=892","1283":"https:\/\/youtu.be\/5q87K1WaoFI","1223":"https:\/\/youtu.be\/5q87K1WaoFI?t=892","1284":"https:\/\/youtu.be\/5q87K1WaoFI","1224":"https:\/\/youtu.be\/5q87K1WaoFI?t=892","1285":"https:\/\/youtu.be\/5q87K1WaoFI","1225":"https:\/\/youtu.be\/5q87K1WaoFI?t=892","1286":"https:\/\/youtu.be\/5q87K1WaoFI","1226":"https:\/\/youtu.be\/5q87K1WaoFI?t=892"},"wired_link":{"1280":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1220":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1281":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1221":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1282":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1222":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1283":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1223":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1284":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1224":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1285":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1225":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1286":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1226":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning"},"dialog_lvl":{"1280":"grad","1220":"grad","1281":"grad","1221":"grad","1282":"grad","1222":"grad","1283":"grad","1223":"grad","1284":"grad","1224":"grad","1285":"grad","1225":"grad","1286":"grad","1226":"grad"},"dialog_id":{"1280":"machine_learning_6","1220":"machine_learning_6","1281":"machine_learning_6","1221":"machine_learning_6","1282":"machine_learning_6","1222":"machine_learning_6","1283":"machine_learning_6","1223":"machine_learning_6","1284":"machine_learning_6","1224":"machine_learning_6","1285":"machine_learning_6","1225":"machine_learning_6","1286":"machine_learning_6","1226":"machine_learning_6"},"speaker_id":{"1280":5,"1220":1,"1281":5,"1221":1,"1282":5,"1222":1,"1283":5,"1223":1,"1284":5,"1224":1,"1285":5,"1225":1,"1286":5,"1226":1},"reciever_id":{"1280":1,"1220":5,"1281":1,"1221":5,"1282":1,"1222":5,"1283":1,"1223":5,"1284":1,"1224":5,"1285":1,"1225":5,"1286":1,"1226":5},"turn_id":{"1280":1,"1220":2,"1281":3,"1221":4,"1282":5,"1222":6,"1283":7,"1223":8,"1284":9,"1224":10,"1285":11,"1225":12,"1286":13,"1226":14},"turn":{"1280":["I'm in my first year of a PhD in Computer Science","and I'm studying natural language processing","and machine learning."],"1220":["So would you mind telling me a bit about","what you've been working on or interested in lately?"],"1281":["I've been looking at understanding persuasion","in online text and the ways that we might be able to","automatically detect the intent behind that persuasion","or who it's targeted at","and what makes effective persuasive techniques."],"1221":["So what are some of the techniques you're applying","to look at that debate data?"],"1282":["Something I'm interested in exploring","is how well it works to use deep learning","and sort of automatically extracted features from this text","versus using some of the more traditional techniques","that we have, things like lexicons","or some sort of template matching techniques","for extracting features from texts.","That's a question I'm just interested in, in general.","When do we really need deep learning","versus when can we use something","that's a little bit more interpretable,","something that's been around for a while?"],"1222":["Do you think there are going to be general principles","that guide those decisions?","Because right now, it's generally","up to the machine learning engineer to decide","what tools they want to apply."],"1283":["I definitely think there is,","but I also, sort of, see it varying a lot","based on the use case,","something that, kind of, works out of the box","and maybe works a little bit more automatically","might be better.","And in other cases, you do, sort of, kind of,","you want a lot of fine grain control."],"1223":["So is that where some of that frustration","around the lack of controllability","and interpretability comes from?"],"1284":["Yeah, if you're building a model","that just predicts the next thing","based off of everything it's seen from texts online,","then yeah, you're really gonna be replicating","whatever that distribution online is."],"1224":["If you train a model off of language off the internet,","it sometimes says uncomfortable things","or inappropriate things and sometimes really biased things.","Have you ever run into this yourself?","And then how do you think about that problem","of potentially even measuring the bias","in a model that we've trained?"],"1285":["Yeah, it's a really tricky question.","As you said, these models are trained to, sort of, predict","the next sequence of words,","given a certain sequence of words.","So we could start with just, sort of, prompts","like the woman was versus the man was,","and, kind of, pull out common words","that are, sort of, more used","with one phrase versus the other.","So that's, sort of, a qualitative way of looking at it.","It's not ever kind of a guarantee of how the model","is gonna behave in one particular instance.","And I think that's what's really tricky","and that's why I, sort of, think it's really good","for creators of systems to just be honest","about, This is, sort of, what we have seen.","And so then, someone can make their own judgment about,","Is this gonna be too high risk","for, sort of, my particular use case?"],"1225":["I imagine in the last few years,","we've seen a lot of changes and improvements","in the capabilities of NLP systems.","So is there anything in that","that you're particularly excited about exploring further?"],"1286":["I'm really interested in, sort of, the creative potential","that we've started to see from NLP systems","with things like GPT-3","and other really powerful language models.","It's really easy to write long grammatical passages","thinking about the way that we can then harness, like,","the human ability to actually give meaning to those words","and, sort of, provide structure","and how we can combine those things with the, kind of like,","generative capabilities of these models now","is really interesting."],"1226":["Yeah, I agree."]},"turn_sentences":{"1280":["I'm in my first year of a PhD in Computer Science and I'm studying natural language processing and machine learning."],"1220":["So would you mind telling me a bit about what you've been working on or interested in lately?"],"1281":["I've been looking at understanding persuasion in online text and the ways that we might be able to automatically detect the intent behind that persuasion or who it's targeted at and what makes effective persuasive techniques."],"1221":["So what are some of the techniques you're applying to look at that debate data?"],"1282":["Something I'm interested in exploring is how well it works to use deep learning and sort of automatically extracted features from this text versus using some of the more traditional techniques that we have, things like lexicons or some sort of template matching techniques for extracting features from texts.","That's a question I'm just interested in, in general.","When do we really need deep learning versus when can we use something that's a little bit more interpretable, something that's been around for a while?"],"1222":["Do you think there are going to be general principles that guide those decisions?","Because right now, it's generally up to the machine learning engineer to decide what tools they want to apply."],"1283":["I definitely think there is, but I also, sort of, see it varying a lot based on the use case, something that, kind of, works out of the box and maybe works a little bit more automatically might be better.","And in other cases, you do, sort of, kind of, you want a lot of fine grain control."],"1223":["So is that where some of that frustration around the lack of controllability and interpretability comes from?"],"1284":["Yeah, if you're building a model that just predicts the next thing based off of everything it's seen from texts online, then yeah, you're really gonna be replicating whatever that distribution online is."],"1224":["If you train a model off of language off the internet, it sometimes says uncomfortable things or inappropriate things and sometimes really biased things.","Have you ever run into this yourself?","And then how do you think about that problem of potentially even measuring the bias in a model that we've trained?"],"1285":["Yeah, it's a really tricky question.","As you said, these models are trained to, sort of, predict the next sequence of words, given a certain sequence of words.","So we could start with just, sort of, prompts like the woman was versus the man was, and, kind of, pull out common words that are, sort of, more used with one phrase versus the other.","So that's, sort of, a qualitative way of looking at it.","It's not ever kind of a guarantee of how the model is gonna behave in one particular instance.","And I think that's what's really tricky and that's why I, sort of, think it's really good for creators of systems to just be honest about, This is, sort of, what we have seen.","And so then, someone can make their own judgment about, Is this gonna be too high risk for, sort of, my particular use case?"],"1225":["I imagine in the last few years, we've seen a lot of changes and improvements in the capabilities of NLP systems.","So is there anything in that that you're particularly excited about exploring further?"],"1286":["I'm really interested in, sort of, the creative potential that we've started to see from NLP systems with things like GPT-3 and other really powerful language models.","It's really easy to write long grammatical passages thinking about the way that we can then harness, like, the human ability to actually give meaning to those words and, sort of, provide structure and how we can combine those things with the, kind of like, generative capabilities of these models now is really interesting."],"1226":["Yeah, I agree."]},"turn_num_tokens":{"1280":23,"1220":20,"1281":39,"1221":17,"1282":95,"1222":37,"1283":70,"1223":18,"1284":41,"1224":57,"1285":190,"1225":39,"1286":94,"1226":5},"role":{"1280":"Explainee","1220":"Explainer","1281":"Explainee","1221":"Explainer","1282":"Explainee","1222":"Explainer","1283":"Explainee","1223":"Explainer","1284":"Explainee","1224":"Explainer","1285":"Explainee","1225":"Explainer","1286":"Explainee","1226":"Explainer"}}