{"topic":{"1227":"machine_learning","1287":"machine_learning","1228":"machine_learning","1288":"machine_learning","1229":"machine_learning","1289":"machine_learning","1230":"machine_learning","1290":"machine_learning","1231":"machine_learning","1291":"machine_learning","1232":"machine_learning","1292":"machine_learning","1233":"machine_learning","1293":"machine_learning","1234":"machine_learning","1294":"machine_learning","1235":"machine_learning","1295":"machine_learning"},"youtube_link":{"1227":"https:\/\/youtu.be\/5q87K1WaoFI?t=1104","1287":"https:\/\/youtu.be\/5q87K1WaoFI","1228":"https:\/\/youtu.be\/5q87K1WaoFI?t=1104","1288":"https:\/\/youtu.be\/5q87K1WaoFI","1229":"https:\/\/youtu.be\/5q87K1WaoFI?t=1104","1289":"https:\/\/youtu.be\/5q87K1WaoFI","1230":"https:\/\/youtu.be\/5q87K1WaoFI?t=1104","1290":"https:\/\/youtu.be\/5q87K1WaoFI","1231":"https:\/\/youtu.be\/5q87K1WaoFI?t=1104","1291":"https:\/\/youtu.be\/5q87K1WaoFI","1232":"https:\/\/youtu.be\/5q87K1WaoFI?t=1104","1292":"https:\/\/youtu.be\/5q87K1WaoFI","1233":"https:\/\/youtu.be\/5q87K1WaoFI?t=1104","1293":"https:\/\/youtu.be\/5q87K1WaoFI","1234":"https:\/\/youtu.be\/5q87K1WaoFI?t=1104","1294":"https:\/\/youtu.be\/5q87K1WaoFI","1235":"https:\/\/youtu.be\/5q87K1WaoFI?t=1104","1295":"https:\/\/youtu.be\/5q87K1WaoFI"},"wired_link":{"1227":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1287":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1228":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1288":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1229":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1289":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1230":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1290":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1231":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1291":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1232":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1292":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1233":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1293":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1234":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1294":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1235":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning","1295":"https:\/\/www.wired.com\/video\/watch\/5-levels-machine-learning"},"dialog_lvl":{"1227":"colleague","1287":"colleague","1228":"colleague","1288":"colleague","1229":"colleague","1289":"colleague","1230":"colleague","1290":"colleague","1231":"colleague","1291":"colleague","1232":"colleague","1292":"colleague","1233":"colleague","1293":"colleague","1234":"colleague","1294":"colleague","1235":"colleague","1295":"colleague"},"dialog_id":{"1227":"machine_learning_7","1287":"machine_learning_7","1228":"machine_learning_7","1288":"machine_learning_7","1229":"machine_learning_7","1289":"machine_learning_7","1230":"machine_learning_7","1290":"machine_learning_7","1231":"machine_learning_7","1291":"machine_learning_7","1232":"machine_learning_7","1292":"machine_learning_7","1233":"machine_learning_7","1293":"machine_learning_7","1234":"machine_learning_7","1294":"machine_learning_7","1235":"machine_learning_7","1295":"machine_learning_7"},"speaker_id":{"1227":1,"1287":6,"1228":1,"1288":6,"1229":1,"1289":6,"1230":1,"1290":6,"1231":1,"1291":6,"1232":1,"1292":6,"1233":1,"1293":6,"1234":1,"1294":6,"1235":1,"1295":6},"reciever_id":{"1227":6,"1287":1,"1228":6,"1288":1,"1229":6,"1289":1,"1230":6,"1290":1,"1231":6,"1291":1,"1232":6,"1292":1,"1233":6,"1293":1,"1234":6,"1294":1,"1235":6,"1295":1},"turn_id":{"1227":1,"1287":2,"1228":3,"1288":4,"1229":5,"1289":6,"1230":7,"1290":8,"1231":9,"1291":10,"1232":11,"1292":12,"1233":13,"1293":14,"1234":15,"1294":16,"1235":17,"1295":18},"turn":{"1227":["So, hi Claudia. It's so great to see you."],"1287":["It has been far too long."],"1228":["You know, we first met 10, 11 years ago","and machine learning has changed a lot since then."],"1288":["Tooling that we now have, the capacity,","and also, an elevation of the problem sets","that we're dealing with and how to frame the problem.","And I'm almost struggling to figure out","whether it's a blessing or curse that it has become","as accessible and as democratized and as easy to execute","and you just build another new company from scratch.","And so, what's been, kind of, your reflection on that?"],"1229":["Well, you're absolutely right that the attention","machine learning gets has grown dramatically.","20 years ago, going to gatherings","and telling people what I was working on","and seeing the blank face or the like,","Where's the turn? and walk away.","Like, Oh, no.","The accessibility of the tooling,","like, we can now do in, like, five lines of code","something that would have taken 500 lines","of very mathematical, messy, gnarly code","even, you know, five years ago.","And that's not an exaggeration.","And there are tools that mean that pretty much anyone","can pick this up and start playing with it","and start to build with it.","And that is also really exciting."],"1289":["In contrast, what I'm struggling with,","the friend of mine who asked me","to look at some health care data for him.","And despite the capabilities that we're having","in all of the, kind of, bigger societal problems","alongside with data collection engineering,","all the gnarly stuff,","that is actually not the machine learning itself,","it's the rest of it where certain data isn't available.","And to me, it's staggering how difficult it is","to get it off the ground and actually use."],"1230":["And part of the challenge of it","is not the mathematics of building models,","but the challenge is making sure that the data","is sufficiently representative, potentially high quality."],"1290":["And how transparent do I need to build it","for it to be adopted at some point?","What types of biases in the data collection,","and then also in the usage?","We now call it the bias, but we're still struggling","with the society not really living up to its expectations","and then machine learning, bringing it to the forefront."],"1231":["Right.","And so, to say that another way,","when you're collecting data from the real world","and then building machine learning systems","that automate decisions based on that data,","all of the biases and problems","that are already in the real world then can be magnified","through that machine learning system.","And so, it can make many of these problems much worse."],"1291":["Feeling increasingly challenged","that my skillset of being very good at programming","has become somewhat secondary.","And it's feeling...","[both laugh]","It's really the bigger picture understanding","of Who would be using that?","How transparent do I need to build it","for it to be adopted at some point?","What types of biases in the data collection","and then also in the usage?","I think, in certain areas, we have societal expectations","as to what is fair and what isn't."],"1232":["And so, it's not just the provenance of that data,","but it's, sort of, deeply understanding,","Why does it look the way it looks?","Why was it collected this way?","What are the limitations of it?","We need to think about that","in entire process, how we document that process.","This is an issue in companies","where somebody might create something","that even their peers can't recreate."],"1292":["What have you seen in terms of which industries,","where they stand, like who is adopting now?","Who is ready to utilize it?","Where would you maybe wish that didn't even try?","[Hilary laughs]"],"1233":["These are great questions.","So things like actuarial science, operations research,","where they actually are not using machine learning","as much as you might think.","And then you have other sorts of companies","or on the FinTech side, or even the ad tech side of things","where they perhaps are using machine learning","to the point of even absurdity."],"1293":["So I spent about eight years working in ad tech.","And the motivation was really","because it was such an amazingly exciting playground","to push that technology","that used to largely live in academia, really,","out in the world and see, kind of, what it can achieve.","It has created such a hunger for data","that now everything is being collected.","I'm curious, when are we going to","make a foray into things like agriculture","about smart production of the things we eat?","You see and hear these interesting stories,","but I feel like we're not ready yet","to put that into a economically viable situation."],"1234":["So when we think about the next five to 10 years,","the things that are really still holding us back","are these uneven applications of resources to problems","because the problems that get attention","are the high value ones","in terms of how much money you can make","or the things that are fashionable enough","that you can publish a paper on it.","So what do you think is holding us back?"],"1294":["I fully agree on the steps you pointed out","and the processes.","I think there is a chicken and egg problem,","like your former example,","that these areas that need to wait for data,","the value of the data collection","is then also slightly less apparent.","And so, it gets delayed further","and you'll see that happening.","But what my experience has been,","there's unfortunately, I feel a drifting apart","between academia","and the uses of AI,","but I am somewhat frustrated with a generation of students","who have standard data sets that they never think about","what the model needs to be used for,","that they never have to think about","how the data was collected.","So with all of these challenges ahead of us,","how optimistic are you about this world","that I deeply believe we can create","and the steps towards it?"],"1235":["I am incredibly optimistic and not...","Perhaps it's a personality flaw, but I can't help but look","at the potential of the technology to reduce harm,","to give us information that help us make better decisions.","And to think that we would choose","to address the big problems ahead of us.","I don't think we have a hope of addressing them","without figuring out the role","that machine learning will play.","And to think that we would then choose not to do that","is just unthinkable."],"1295":["Despite that the rightfully raised concerns","about the challenges ahead,","but I think they also make us as a society better.","They challenge us to be a lot clearer","of what fairness means to all of us.","So with all of the setbacks,","I think we have exciting years to come.","And I am looking forward to a world where a lot more of that","is used for the right purposes."]},"turn_sentences":{"1227":["So, hi Claudia.","It's so great to see you."],"1287":["It has been far too long."],"1228":["You know, we first met 10, 11 years ago and machine learning has changed a lot since then."],"1288":["Tooling that we now have, the capacity, and also, an elevation of the problem sets that we're dealing with and how to frame the problem.","And I'm almost struggling to figure out whether it's a blessing or curse that it has become as accessible and as democratized and as easy to execute and you just build another new company from scratch.","And so, what's been, kind of, your reflection on that?"],"1229":["Well, you're absolutely right that the attention machine learning gets has grown dramatically.","20 years ago, going to gatherings and telling people what I was working on and seeing the blank face or the like, Where's the turn?","and walk away.","Like, Oh, no.","The accessibility of the tooling, like, we can now do in, like, five lines of code something that would have taken 500 lines of very mathematical, messy, gnarly code even, you know, five years ago.","And that's not an exaggeration.","And there are tools that mean that pretty much anyone can pick this up and start playing with it and start to build with it.","And that is also really exciting."],"1289":["In contrast, what I'm struggling with, the friend of mine who asked me to look at some health care data for him.","And despite the capabilities that we're having in all of the, kind of, bigger societal problems alongside with data collection engineering, all the gnarly stuff, that is actually not the machine learning itself, it's the rest of it where certain data isn't available.","And to me, it's staggering how difficult it is to get it off the ground and actually use."],"1230":["And part of the challenge of it is not the mathematics of building models, but the challenge is making sure that the data is sufficiently representative, potentially high quality."],"1290":["And how transparent do I need to build it for it to be adopted at some point?","What types of biases in the data collection, and then also in the usage?","We now call it the bias, but we're still struggling with the society not really living up to its expectations and then machine learning, bringing it to the forefront."],"1231":["Right.","And so, to say that another way, when you're collecting data from the real world and then building machine learning systems that automate decisions based on that data, all of the biases and problems that are already in the real world then can be magnified through that machine learning system.","And so, it can make many of these problems much worse."],"1291":["Feeling increasingly challenged that my skillset of being very good at programming has become somewhat secondary.","And it's feeling... [both laugh] It's really the bigger picture understanding of Who would be using that?","How transparent do I need to build it for it to be adopted at some point?","What types of biases in the data collection and then also in the usage?","I think, in certain areas, we have societal expectations as to what is fair and what isn't."],"1232":["And so, it's not just the provenance of that data, but it's, sort of, deeply understanding, Why does it look the way it looks?","Why was it collected this way?","What are the limitations of it?","We need to think about that in entire process, how we document that process.","This is an issue in companies where somebody might create something that even their peers can't recreate."],"1292":["What have you seen in terms of which industries, where they stand, like who is adopting now?","Who is ready to utilize it?","Where would you maybe wish that didn't even try?","[Hilary laughs]"],"1233":["These are great questions.","So things like actuarial science, operations research, where they actually are not using machine learning as much as you might think.","And then you have other sorts of companies or on the FinTech side, or even the ad tech side of things where they perhaps are using machine learning to the point of even absurdity."],"1293":["So I spent about eight years working in ad tech.","And the motivation was really because it was such an amazingly exciting playground to push that technology that used to largely live in academia, really, out in the world and see, kind of, what it can achieve.","It has created such a hunger for data that now everything is being collected.","I'm curious, when are we going to make a foray into things like agriculture about smart production of the things we eat?","You see and hear these interesting stories, but I feel like we're not ready yet to put that into a economically viable situation."],"1234":["So when we think about the next five to 10 years, the things that are really still holding us back are these uneven applications of resources to problems because the problems that get attention are the high value ones in terms of how much money you can make or the things that are fashionable enough that you can publish a paper on it.","So what do you think is holding us back?"],"1294":["I fully agree on the steps you pointed out and the processes.","I think there is a chicken and egg problem, like your former example, that these areas that need to wait for data, the value of the data collection is then also slightly less apparent.","And so, it gets delayed further and you'll see that happening.","But what my experience has been, there's unfortunately, I feel a drifting apart between academia and the uses of AI, but I am somewhat frustrated with a generation of students who have standard data sets that they never think about what the model needs to be used for, that they never have to think about how the data was collected.","So with all of these challenges ahead of us, how optimistic are you about this world that I deeply believe we can create and the steps towards it?"],"1235":["I am incredibly optimistic and not... Perhaps it's a personality flaw, but I can't help but look at the potential of the technology to reduce harm, to give us information that help us make better decisions.","And to think that we would choose to address the big problems ahead of us.","I don't think we have a hope of addressing them without figuring out the role that machine learning will play.","And to think that we would then choose not to do that is just unthinkable."],"1295":["Despite that the rightfully raised concerns about the challenges ahead, but I think they also make us as a society better.","They challenge us to be a lot clearer of what fairness means to all of us.","So with all of the setbacks, I think we have exciting years to come.","And I am looking forward to a world where a lot more of that is used for the right purposes."]},"turn_num_tokens":{"1227":13,"1287":7,"1228":21,"1288":84,"1229":139,"1289":99,"1230":32,"1290":67,"1231":70,"1291":93,"1232":81,"1292":42,"1233":65,"1293":119,"1234":75,"1294":161,"1235":96,"1295":77},"role":{"1227":"Explainer","1287":"Explainee","1228":"Explainer","1288":"Explainee","1229":"Explainer","1289":"Explainee","1230":"Explainer","1290":"Explainee","1231":"Explainer","1291":"Explainee","1232":"Explainer","1292":"Explainee","1233":"Explainer","1293":"Explainee","1234":"Explainer","1294":"Explainee","1235":"Explainer","1295":"Explainee"}}