{"topic":{"434":"nano_technology","480":"nano_technology","435":"nano_technology","481":"nano_technology","436":"nano_technology","482":"nano_technology","437":"nano_technology","483":"nano_technology","438":"nano_technology","484":"nano_technology","439":"nano_technology","485":"nano_technology","440":"nano_technology","486":"nano_technology"},"youtube_link":{"434":"https:\/\/youtu.be\/WW0IIyrq8z4?t=965","480":"https:\/\/youtu.be\/WW0IIyrq8z4","435":"https:\/\/youtu.be\/WW0IIyrq8z4?t=965","481":"https:\/\/youtu.be\/WW0IIyrq8z4","436":"https:\/\/youtu.be\/WW0IIyrq8z4?t=965","482":"https:\/\/youtu.be\/WW0IIyrq8z4","437":"https:\/\/youtu.be\/WW0IIyrq8z4?t=965","483":"https:\/\/youtu.be\/WW0IIyrq8z4","438":"https:\/\/youtu.be\/WW0IIyrq8z4?t=965","484":"https:\/\/youtu.be\/WW0IIyrq8z4","439":"https:\/\/youtu.be\/WW0IIyrq8z4?t=965","485":"https:\/\/youtu.be\/WW0IIyrq8z4","440":"https:\/\/youtu.be\/WW0IIyrq8z4?t=965","486":"https:\/\/youtu.be\/WW0IIyrq8z4"},"wired_link":{"434":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","480":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","435":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","481":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","436":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","482":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","437":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","483":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","438":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","484":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","439":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","485":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","440":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology","486":"https:\/\/www.wired.com\/video\/watch\/5-levels-nanotechnology"},"dialog_lvl":{"434":"colleague","480":"colleague","435":"colleague","481":"colleague","436":"colleague","482":"colleague","437":"colleague","483":"colleague","438":"colleague","484":"colleague","439":"colleague","485":"colleague","440":"colleague","486":"colleague"},"dialog_id":{"434":"nano_technology_7","480":"nano_technology_7","435":"nano_technology_7","481":"nano_technology_7","436":"nano_technology_7","482":"nano_technology_7","437":"nano_technology_7","483":"nano_technology_7","438":"nano_technology_7","484":"nano_technology_7","439":"nano_technology_7","485":"nano_technology_7","440":"nano_technology_7","486":"nano_technology_7"},"speaker_id":{"434":1,"480":6,"435":1,"481":6,"436":1,"482":6,"437":1,"483":6,"438":1,"484":6,"439":1,"485":6,"440":1,"486":6},"reciever_id":{"434":6,"480":1,"435":6,"481":1,"436":6,"482":1,"437":6,"483":1,"438":6,"484":1,"439":6,"485":1,"440":6,"486":1},"turn_id":{"434":1,"480":2,"435":3,"481":4,"436":5,"482":6,"437":7,"483":8,"438":9,"484":10,"439":11,"485":12,"440":13,"486":14},"turn":{"434":["I remember reading your papers when I was a student","and we're all trying to create these materials","and finding ways to exploit their properties.","What I love, and I'm delighted that you're here","to talk to us about is how you took inspiration from nature","and sort of recognize that nature's figured out a way","to both synthesize incredibly complex nanostructures","with high functionality and how you sort of were inspired","by that to do the research that you're doing now."],"480":["Life gave us this toolkit","that is already on the nanoscale.","So we think that that's a great place","to think about making materials on the nano scale","and manipulating materials on the nano scale,","and wiring them together as well.","This abalone shell, you can see","the exquisite beautiful colors and structures of it.","This is a nano composite material.","If you take this and fracture it, and you look at it","in a scanning electron microscope, what you'll see","is that it's made out of these beautiful tablets.","And I studied that as a graduate student.","I looked at that and I said, that is completely amazing.","You have an organism in the ocean,","that takes what's in its environment,","which is calcium and carbonate.","That's dissolved in the water and templates it","into this really exquisite structure.","And so you think that's great.","Calcium carbonate is great,","but what if we wanted to make a solar cell","or a another electronic device or a battery,","how would you get an organism to do that?","And you say, okay, that's a really crazy idea.","But is it really that crazy if this abalone,","already figured out how to do it, 500 million years ago?","So we're saying, okay, abalones build shells.","Can viruses build solar cells, can viruses build catalysts?","Can they build batteries using the same kind of idea?"],"435":["It's really fascinating work,","especially now we're all familiar","with the viruses and how they act.","And I'm not aware of any viruses that build nanostructures.","So how did you come to that?","And then how do you actually program a virus","to do your bidding?"],"481":["We work on something","called bacteriophages, it's a virus with DNA.","This particular bacteriophage called M13 bacteriophage","is made up of single stranded DNA and proteins.","It's long and thin.","So it's 880 nanometers in length,","and it's about 9 nanometers in diameter.","And so one of the reasons I love it","is it spans the nanoscale","and almost the micron scale at the same time.","Take the single strand DNAs, obviously a model,","and you can cut it with molecular scissors.","And you can put a new piece of DNA in between.","And so you put a small piece of DNA in there","that doesn't belong there.","And that piece of DNA","is going to randomly code for a protein.","Now, the next time that that virus is replicated","within a bacterial host,","it'll be able to put a new protein sequence on the coat,","just a short protein sequence on the coat,","maybe like 8 or 12 amino acids in length.","And just like that abalone is going to grab calcium","and build calcium carbonate.","We're going to have our viruses build iron phosphate","for a battery electrode material","or Gallium arsenide or cad sulfide","for a semiconductor material."],"436":["So you've evolved, and I suppose, trained these viruses","to build the materials that you want them to build","by exposing them to the raw materials","and then evolving their function.","We're talking about the electronics from nanomaterials.","That critical issue that we're facing","is how do you go from those single experiments","with a single material, understanding its properties,","how do you scale that to the billions of devices","that you need in a technology?","It is a chemistry driven approach.","We're not going to grow them exactly where we want them,","but to take that one step,","and to tie into what you're doing,","tt sounds like there could be an area of collaboration","where instead of using conventional chemistry,","that we can train some of these biological elements","to do that work work for us."],"482":["Biology is chemistry.","Molecules, proteins,","and DNA work with all the same kinds of bonding","and things that the chemicals","that you're gonna be looking for in these processes.","It's put together in a way","that when a protein or enzyme folds,","it almost always folds correctly.","That's kind of the beauty of it,","the predictable aspect of it encoded in its DNA.","If we need to make it the same over and over again,","then as long as you have the right DNA sequence,","DNA is a beautiful structure on the nanoscale.","And there's really, really cool, incredible work","on DNA origami, when DNA can fold","into just the right structure.","And so I can see that as an interface,","that would be really cool and interesting in your work.","And you can have the virus make the DNA for the DNA origami,","and then you use DNA to assemble your beautiful structures."],"437":["It's really fascinating.","You have all these little worker viruses","building the materials for you.","How are you then applying these materials","that you're building?"],"483":["We started thinking about","how can we make an impact in cancer?","We do it mostly in imaging technology","to look deep inside the body noninvasively with light.","And the way that we came about that","was through solar cells and batteries.","We trained our viruses to pick up carbon nanotubes","and hold onto them very, very tightly.","And then we'll give a virus a second gene,","decode for a protein, to grow, in a case of a battery,","a battery electrode material.","It allows it to weave together a good electrical conductor","and a good ionic conductor at the same time,","all within this really, really small space.","And the optical properties of these carbon nanotubes","are in the wavelength.","That is interesting for imaging deep inside the body.","We started building a bunch of imaging tools","that could image above a thousand nanometers, a wave length.","And so this is in [audio distorting]","and that's a really special window","where you have some optical transparency","of tissue in the body.","The other gene, we engineered to find ovarian cancer.","We developed imaging tools with Harvard Medical School","and MIT Lincoln Labs to find tiny ovarian tumors.","It's hard to see things less than a centimeter in size","with ovarian cancer, just based on the location in the body.","But with our imaging system, we could find tumors","that were below a millimeter in size, actually."],"438":["Looking ahead, 5 years, 10 years,","where do you see your own work,","and maybe the field more broadly?"],"484":["The future I'd like to see","is environmentally friendly chemistry","and materials synthesis.","And I think that we're really going that way.","If we think about batteries of the future,","solar cells of the future,","thinking about earth abundant materials and processes","that are compatible with the earth and environment."],"439":["One of the things I love about about nanoscience","is it tends to break up the silos","between those traditional scientific disciplines.","My training was in chemistry,","but I had to very quickly merged chemistry and physics.","And now I see an area where chemistry, physics,","and biology are coming together to produce new materials","and new technology, and to advance the field forward.","And so being in this field,","you kind of have to cross pollinate","between these different disciplines","and kind of advance the field together."],"485":["I agree completely. We like to solve problems.","Nano bio is the toolkit that we bring a lot.","It happens to be a very strong and evolving toolkit.","That's another thing that I love about biology","is if you can come up with a solution","that's not perfect at all to begin with","when you're making a battery electrode material","or any kind of material you're making,","you have evolution on your side","to try to make it better and better as a function of time.","That can be quite rapid."],"440":["So Angela,","thank you so much for joining us.","And I look forward to seeing more work","coming out of your lab in the future."],"486":["Thanks for having me, George,","it was really fun to interact, and I'm very excited","about our future collaborations.","Me too. Absolutely."]},"turn_sentences":{"434":["I remember reading your papers when I was a student and we're all trying to create these materials and finding ways to exploit their properties.","What I love, and I'm delighted that you're here to talk to us about is how you took inspiration from nature and sort of recognize that nature's figured out a way to both synthesize incredibly complex nanostructures with high functionality and how you sort of were inspired by that to do the research that you're doing now."],"480":["Life gave us this toolkit that is already on the nanoscale.","So we think that that's a great place to think about making materials on the nano scale and manipulating materials on the nano scale, and wiring them together as well.","This abalone shell, you can see the exquisite beautiful colors and structures of it.","This is a nano composite material.","If you take this and fracture it, and you look at it in a scanning electron microscope, what you'll see is that it's made out of these beautiful tablets.","And I studied that as a graduate student.","I looked at that and I said, that is completely amazing.","You have an organism in the ocean, that takes what's in its environment, which is calcium and carbonate.","That's dissolved in the water and templates it into this really exquisite structure.","And so you think that's great.","Calcium carbonate is great, but what if we wanted to make a solar cell or a another electronic device or a battery, how would you get an organism to do that?","And you say, okay, that's a really crazy idea.","But is it really that crazy if this abalone, already figured out how to do it, 500 million years ago?","So we're saying, okay, abalones build shells.","Can viruses build solar cells, can viruses build catalysts?","Can they build batteries using the same kind of idea?"],"435":["It's really fascinating work, especially now we're all familiar with the viruses and how they act.","And I'm not aware of any viruses that build nanostructures.","So how did you come to that?","And then how do you actually program a virus to do your bidding?"],"481":["We work on something called bacteriophages, it's a virus with DNA.","This particular bacteriophage called M13 bacteriophage is made up of single stranded DNA and proteins.","It's long and thin.","So it's 880 nanometers in length, and it's about 9 nanometers in diameter.","And so one of the reasons I love it is it spans the nanoscale and almost the micron scale at the same time.","Take the single strand DNAs, obviously a model, and you can cut it with molecular scissors.","And you can put a new piece of DNA in between.","And so you put a small piece of DNA in there that doesn't belong there.","And that piece of DNA is going to randomly code for a protein.","Now, the next time that that virus is replicated within a bacterial host, it'll be able to put a new protein sequence on the coat, just a short protein sequence on the coat, maybe like 8 or 12 amino acids in length.","And just like that abalone is going to grab calcium and build calcium carbonate.","We're going to have our viruses build iron phosphate for a battery electrode material or Gallium arsenide or cad sulfide for a semiconductor material."],"436":["So you've evolved, and I suppose, trained these viruses to build the materials that you want them to build by exposing them to the raw materials and then evolving their function.","We're talking about the electronics from nanomaterials.","That critical issue that we're facing is how do you go from those single experiments with a single material, understanding its properties, how do you scale that to the billions of devices that you need in a technology?","It is a chemistry driven approach.","We're not going to grow them exactly where we want them, but to take that one step, and to tie into what you're doing, tt sounds like there could be an area of collaboration where instead of using conventional chemistry, that we can train some of these biological elements to do that work work for us."],"482":["Biology is chemistry.","Molecules, proteins, and DNA work with all the same kinds of bonding and things that the chemicals that you're gonna be looking for in these processes.","It's put together in a way that when a protein or enzyme folds, it almost always folds correctly.","That's kind of the beauty of it, the predictable aspect of it encoded in its DNA.","If we need to make it the same over and over again, then as long as you have the right DNA sequence, DNA is a beautiful structure on the nanoscale.","And there's really, really cool, incredible work on DNA origami, when DNA can fold into just the right structure.","And so I can see that as an interface, that would be really cool and interesting in your work.","And you can have the virus make the DNA for the DNA origami, and then you use DNA to assemble your beautiful structures."],"437":["It's really fascinating.","You have all these little worker viruses building the materials for you.","How are you then applying these materials that you're building?"],"483":["We started thinking about how can we make an impact in cancer?","We do it mostly in imaging technology to look deep inside the body noninvasively with light.","And the way that we came about that was through solar cells and batteries.","We trained our viruses to pick up carbon nanotubes and hold onto them very, very tightly.","And then we'll give a virus a second gene, decode for a protein, to grow, in a case of a battery, a battery electrode material.","It allows it to weave together a good electrical conductor and a good ionic conductor at the same time, all within this really, really small space.","And the optical properties of these carbon nanotubes are in the wavelength.","That is interesting for imaging deep inside the body.","We started building a bunch of imaging tools that could image above a thousand nanometers, a wave length.","And so this is in [audio distorting] and that's a really special window where you have some optical transparency of tissue in the body.","The other gene, we engineered to find ovarian cancer.","We developed imaging tools with Harvard Medical School and MIT Lincoln Labs to find tiny ovarian tumors.","It's hard to see things less than a centimeter in size with ovarian cancer, just based on the location in the body.","But with our imaging system, we could find tumors that were below a millimeter in size, actually."],"438":["Looking ahead, 5 years, 10 years, where do you see your own work, and maybe the field more broadly?"],"484":["The future I'd like to see is environmentally friendly chemistry and materials synthesis.","And I think that we're really going that way.","If we think about batteries of the future, solar cells of the future, thinking about earth abundant materials and processes that are compatible with the earth and environment."],"439":["One of the things I love about about nanoscience is it tends to break up the silos between those traditional scientific disciplines.","My training was in chemistry, but I had to very quickly merged chemistry and physics.","And now I see an area where chemistry, physics, and biology are coming together to produce new materials and new technology, and to advance the field forward.","And so being in this field, you kind of have to cross pollinate between these different disciplines and kind of advance the field together."],"485":["I agree completely.","We like to solve problems.","Nano bio is the toolkit that we bring a lot.","It happens to be a very strong and evolving toolkit.","That's another thing that I love about biology is if you can come up with a solution that's not perfect at all to begin with when you're making a battery electrode material or any kind of material you're making, you have evolution on your side to try to make it better and better as a function of time.","That can be quite rapid."],"440":["So Angela, thank you so much for joining us.","And I look forward to seeing more work coming out of your lab in the future."],"486":["Thanks for having me, George, it was really fun to interact, and I'm very excited about our future collaborations.","Me too.","Absolutely."]},"turn_num_tokens":{"434":90,"480":272,"435":54,"481":228,"436":156,"482":178,"437":30,"483":268,"438":24,"484":57,"439":97,"485":102,"440":28,"486":29},"role":{"434":"Explainer","480":"Explainee","435":"Explainer","481":"Explainee","436":"Explainer","482":"Explainee","437":"Explainer","483":"Explainee","438":"Explainer","484":"Explainee","439":"Explainer","485":"Explainee","440":"Explainer","486":"Explainee"}}