{"topic":{"1400":"origani","1345":"origani","1401":"origani","1346":"origani","1402":"origani","1347":"origani","1403":"origani","1348":"origani","1404":"origani","1349":"origani","1405":"origani","1350":"origani","1406":"origani","1351":"origani","1407":"origani","1352":"origani","1408":"origani"},"youtube_link":{"1400":"https:\/\/youtu.be\/boaqgdcMjmA","1345":"https:\/\/youtu.be\/boaqgdcMjmA?t=918","1401":"https:\/\/youtu.be\/boaqgdcMjmA","1346":"https:\/\/youtu.be\/boaqgdcMjmA?t=918","1402":"https:\/\/youtu.be\/boaqgdcMjmA","1347":"https:\/\/youtu.be\/boaqgdcMjmA?t=918","1403":"https:\/\/youtu.be\/boaqgdcMjmA","1348":"https:\/\/youtu.be\/boaqgdcMjmA?t=918","1404":"https:\/\/youtu.be\/boaqgdcMjmA","1349":"https:\/\/youtu.be\/boaqgdcMjmA?t=918","1405":"https:\/\/youtu.be\/boaqgdcMjmA","1350":"https:\/\/youtu.be\/boaqgdcMjmA?t=918","1406":"https:\/\/youtu.be\/boaqgdcMjmA","1351":"https:\/\/youtu.be\/boaqgdcMjmA?t=918","1407":"https:\/\/youtu.be\/boaqgdcMjmA","1352":"https:\/\/youtu.be\/boaqgdcMjmA?t=918","1408":"https:\/\/youtu.be\/boaqgdcMjmA"},"wired_link":{"1400":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1345":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1401":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1346":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1402":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1347":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1403":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1348":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1404":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1349":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1405":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1350":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1406":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1351":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1407":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1352":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami","1408":"https:\/\/www.wired.com\/video\/watch\/5-levels-origami"},"dialog_lvl":{"1400":"colleague","1345":"colleague","1401":"colleague","1346":"colleague","1402":"colleague","1347":"colleague","1403":"colleague","1348":"colleague","1404":"colleague","1349":"colleague","1405":"colleague","1350":"colleague","1406":"colleague","1351":"colleague","1407":"colleague","1352":"colleague","1408":"colleague"},"dialog_id":{"1400":"origani_7","1345":"origani_7","1401":"origani_7","1346":"origani_7","1402":"origani_7","1347":"origani_7","1403":"origani_7","1348":"origani_7","1404":"origani_7","1349":"origani_7","1405":"origani_7","1350":"origani_7","1406":"origani_7","1351":"origani_7","1407":"origani_7","1352":"origani_7","1408":"origani_7"},"speaker_id":{"1400":6,"1345":1,"1401":6,"1346":1,"1402":6,"1347":1,"1403":6,"1348":1,"1404":6,"1349":1,"1405":6,"1350":1,"1406":6,"1351":1,"1407":6,"1352":1,"1408":6},"reciever_id":{"1400":1,"1345":6,"1401":1,"1346":6,"1402":1,"1347":6,"1403":1,"1348":6,"1404":1,"1349":6,"1405":1,"1350":6,"1406":1,"1351":6,"1407":1,"1352":6,"1408":1},"turn_id":{"1400":1,"1345":2,"1401":3,"1346":4,"1402":5,"1347":6,"1403":7,"1348":8,"1404":9,"1349":10,"1405":11,"1350":12,"1406":13,"1351":14,"1407":15,"1352":16,"1408":17},"turn":{"1400":["I'm Tom Hull, I'm a math professor, a mathematician.","I've been doing origami since I was eight years old","and studying the mathematics of origami","ever since grad school, at least."],"1345":["The first thing I want to show you","is origami in the real world.","This is the origami lamp.","It comes shipped flat but it folds, clip holds it together.","The lamp has LEDs on the inside","so when we power it up we get light, we have a lampshade","and we get the base."],"1401":["Why does origami lend itself","to, say, this type of application?"],"1346":["Origami applications have in common,","is that at some stage the thing is flat","and so whenever you need to either start from a flat state","and then take it to a 3D state,","or conversely, for deployables like space,","you want to have it in a fully folded flat state","but then take it to a 3D state,","or possibly an unfolded flat state.","Whenever a flat state is involved,","origami is a really effective way","of making the transition between those states."],"1402":["Another aspect of origami and origami mechanisms","that has leant itself to many different uses","is the fact that it's scalable.","When you have an origami crease pattern","like the Miura-Ori used in solar panel deployment,","the type of motion that you see happening here","will happen whether this is on a piece of paper","that's small like this, or on a larger scale,","or even on a smaller, smaller, smaller, smaller scale.","Engineers, in particular robotics engineers,","are turning to origami","toward designing mechanisms that will either be really big","or really, really small.","This looks like the most promising way","of getting nano robotics to work."],"1347":["This is another real-world application","but this particular implementation","is used to make a wheel for a Rover."],"1403":["Cool, so this is something","that can actually get really, really tiny","but then get big and fat and roll."],"1348":["New problems arise","when we try to make origami out of things other than paper,","but also new opportunities.","An example here","which is a kind of a variant of the Miura-Ori.","It's got a three-dimensional structure.","If I stretch it one way, it expands the other","but because it has these S-bends in the pattern,","if you squeeze it, it doesn't go all the way flat.","This is a epoxy impregnated aramid fiber","and so if I put this fold pattern into it","and then compress it","and then put a skin on the top and bottom,","this becomes incredibly lightweight but incredibly strong."],"1404":["Yeah!"],"1349":["Another origami challenge","that comes up with these patterns","is if we're going to make an aircraft out of this thing","we're going to need hundreds of yards of folded origami.","We're not going to do it by hand","and this might be the new frontier in origami engineering,","which is the design of machines","that can fold patterns that have applications."],"1405":["So you're talking about a machine","that is actually folding it into this,","not just making the creases but actually folding it."],"1350":["Yeah, so what goes in as sheet","and what comes out is this, or something this wide."],"1406":["That's cool, yeah.","What do you see as kind of like the next big breakthrough?","Is there anything out there on the horizon","that you're just like, oh wow, this is really exciting?"],"1351":["It's something we've talked about a little bit","that with all the richness of behavior","of origami from a flat sheet,","it seems like there ought to be an equally rich world","of things that don't start flat","but are still made from flat sheets of paper."],"1407":["So like a cone?"],"1352":["Bi-stable properties","and you can combine them together with copies of themselves","to make cellular structures.","They're astonishingly stiff and rigid, useful for mechanics."],"1408":["The thing that I think I'm the most excited about","comes from math mainly.","When I look at origami,","when I look at all these applications","or just all these different origami folds, I see structure.","Math is really about patterns.","The patterns that we see in origami","are reflecting some kind of mathematical structure","and we don't quite know yet what all of that structure is","and if we can tie a mathematical structure","that's already well-studied","to something we see happening in origami,","then we can use the math tools right away","to help solve the engineering problems","and the origami problems.","And the fact that there's so many applications to this","is really making people excited who are working in the area.","I'm really excited to see what happens with that","in the next five years or so."]},"turn_sentences":{"1400":["I'm Tom Hull, I'm a math professor, a mathematician.","I've been doing origami since I was eight years old and studying the mathematics of origami ever since grad school, at least."],"1345":["The first thing I want to show you is origami in the real world.","This is the origami lamp.","It comes shipped flat but it folds, clip holds it together.","The lamp has LEDs on the inside so when we power it up we get light, we have a lampshade and we get the base."],"1401":["Why does origami lend itself to, say, this type of application?"],"1346":["Origami applications have in common, is that at some stage the thing is flat and so whenever you need to either start from a flat state and then take it to a 3D state, or conversely, for deployables like space, you want to have it in a fully folded flat state but then take it to a 3D state, or possibly an unfolded flat state.","Whenever a flat state is involved, origami is a really effective way of making the transition between those states."],"1402":["Another aspect of origami and origami mechanisms that has leant itself to many different uses is the fact that it's scalable.","When you have an origami crease pattern like the Miura-Ori used in solar panel deployment, the type of motion that you see happening here will happen whether this is on a piece of paper that's small like this, or on a larger scale, or even on a smaller, smaller, smaller, smaller scale.","Engineers, in particular robotics engineers, are turning to origami toward designing mechanisms that will either be really big or really, really small.","This looks like the most promising way of getting nano robotics to work."],"1347":["This is another real-world application but this particular implementation is used to make a wheel for a Rover."],"1403":["Cool, so this is something that can actually get really, really tiny but then get big and fat and roll."],"1348":["New problems arise when we try to make origami out of things other than paper, but also new opportunities.","An example here which is a kind of a variant of the Miura-Ori.","It's got a three-dimensional structure.","If I stretch it one way, it expands the other but because it has these S-bends in the pattern, if you squeeze it, it doesn't go all the way flat.","This is a epoxy impregnated aramid fiber and so if I put this fold pattern into it and then compress it and then put a skin on the top and bottom, this becomes incredibly lightweight but incredibly strong."],"1404":["Yeah!"],"1349":["Another origami challenge that comes up with these patterns is if we're going to make an aircraft out of this thing we're going to need hundreds of yards of folded origami.","We're not going to do it by hand and this might be the new frontier in origami engineering, which is the design of machines that can fold patterns that have applications."],"1405":["So you're talking about a machine that is actually folding it into this, not just making the creases but actually folding it."],"1350":["Yeah, so what goes in as sheet and what comes out is this, or something this wide."],"1406":["That's cool, yeah.","What do you see as kind of like the next big breakthrough?","Is there anything out there on the horizon that you're just like, oh wow, this is really exciting?"],"1351":["It's something we've talked about a little bit that with all the richness of behavior of origami from a flat sheet, it seems like there ought to be an equally rich world of things that don't start flat but are still made from flat sheets of paper."],"1407":["So like a cone?"],"1352":["Bi-stable properties and you can combine them together with copies of themselves to make cellular structures.","They're astonishingly stiff and rigid, useful for mechanics."],"1408":["The thing that I think I'm the most excited about comes from math mainly.","When I look at origami, when I look at all these applications or just all these different origami folds, I see structure.","Math is really about patterns.","The patterns that we see in origami are reflecting some kind of mathematical structure and we don't quite know yet what all of that structure is and if we can tie a mathematical structure that's already well-studied to something we see happening in origami, then we can use the math tools right away to help solve the engineering problems and the origami problems.","And the fact that there's so many applications to this is really making people excited who are working in the area.","I'm really excited to see what happens with that in the next five years or so."]},"turn_num_tokens":{"1400":39,"1345":61,"1401":14,"1346":92,"1402":123,"1347":19,"1403":23,"1348":117,"1404":2,"1349":68,"1405":25,"1350":20,"1406":41,"1351":52,"1407":5,"1352":28,"1408":155},"role":{"1400":"Explainee","1345":"Explainer","1401":"Explainee","1346":"Explainer","1402":"Explainee","1347":"Explainer","1403":"Explainee","1348":"Explainer","1404":"Explainee","1349":"Explainer","1405":"Explainee","1350":"Explainer","1406":"Explainee","1351":"Explainer","1407":"Explainee","1352":"Explainer","1408":"Explainee"}}