{"topic":{"314":"sleep_scientist","387":"sleep_scientist","315":"sleep_scientist","388":"sleep_scientist","316":"sleep_scientist","389":"sleep_scientist","317":"sleep_scientist","390":"sleep_scientist","318":"sleep_scientist","391":"sleep_scientist","319":"sleep_scientist","392":"sleep_scientist","320":"sleep_scientist"},"youtube_link":{"314":"https:\/\/youtu.be\/OB61yG8WDyU?t=1119","387":"https:\/\/youtu.be\/OB61yG8WDyU","315":"https:\/\/youtu.be\/OB61yG8WDyU?t=1119","388":"https:\/\/youtu.be\/OB61yG8WDyU","316":"https:\/\/youtu.be\/OB61yG8WDyU?t=1119","389":"https:\/\/youtu.be\/OB61yG8WDyU","317":"https:\/\/youtu.be\/OB61yG8WDyU?t=1119","390":"https:\/\/youtu.be\/OB61yG8WDyU","318":"https:\/\/youtu.be\/OB61yG8WDyU?t=1119","391":"https:\/\/youtu.be\/OB61yG8WDyU","319":"https:\/\/youtu.be\/OB61yG8WDyU?t=1119","392":"https:\/\/youtu.be\/OB61yG8WDyU","320":"https:\/\/youtu.be\/OB61yG8WDyU?t=1119"},"wired_link":{"314":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","387":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","315":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","388":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","316":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","389":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","317":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","390":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","318":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","391":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","319":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","392":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty","320":"https:\/\/www.wired.com\/video\/watch\/sleep-scientist-explains-one-concept-in-5-levels-of-difficulty"},"dialog_lvl":{"314":"colleague","387":"colleague","315":"colleague","388":"colleague","316":"colleague","389":"colleague","317":"colleague","390":"colleague","318":"colleague","391":"colleague","319":"colleague","392":"colleague","320":"colleague"},"dialog_id":{"314":"sleep_scientist_7","387":"sleep_scientist_7","315":"sleep_scientist_7","388":"sleep_scientist_7","316":"sleep_scientist_7","389":"sleep_scientist_7","317":"sleep_scientist_7","390":"sleep_scientist_7","318":"sleep_scientist_7","391":"sleep_scientist_7","319":"sleep_scientist_7","392":"sleep_scientist_7","320":"sleep_scientist_7"},"speaker_id":{"314":1,"387":6,"315":1,"388":6,"316":1,"389":6,"317":1,"390":6,"318":1,"391":6,"319":1,"392":6,"320":1},"reciever_id":{"314":6,"387":1,"315":6,"388":1,"316":6,"389":1,"317":6,"390":1,"318":6,"391":1,"319":6,"392":1,"320":6},"turn_id":{"314":1,"387":2,"315":3,"388":4,"316":5,"389":6,"317":7,"390":8,"318":9,"391":10,"319":11,"392":12,"320":13},"turn":{"314":["Good to see you again, Yue."],"387":["Yes, good to see you."],"315":["Really glad that you could join us.","So we've been talking about sleep today,","various levels of complexity.","But now with you, I really want to talk about","what do we know about sleep and the aging brain.","Can you tell me a little bit about","some of the work that you've been doing in that area?"],"388":["So I'm a epidemiologist,","so we do a lot of work","on the epidemiology of sleep","and development of neurodegenerative diseases","including both Alzheimer's and Parkinson's disease,","so ADMPD.","We mainly work on population studies.","We work on thousands and even millions of population,","and we use statistical modeling to find out","the association between different sleep disturbances","and also genetics related to sleep disturbances","and link that to their risk of developing ADMPD."],"316":["So how strong is the link?"],"389":["Our study has found really strong associations","looking at these populations, for example, with sleep apnea.","We've done one meta-analysis and it's showed that","those with sleep apnea, they have a ratio of 1.26,","which means that those who have sleep apnea","have 26% elevated risk of developing Alzheimer's","compared to those without sleep apnea."],"317":["So it's interesting, so I also saw","that there was also a recent meta-analysis","around sleep disturbances and dementia risk,","and in that study, they looked about 250,000 people","in this meta-analysis,","and they followed them around for 10 years,","and you know, when they pulled all the samples together,","they found there was a 1.2 fold increased risk","for developing all caused dementia,","so it sounds like both sleep apnea","and then maybe sleep disturbances more generally","are associated with increased risk for dementia.","When I think about that, I think about how","sleep lives in the brain,","these neurodegenerative diseases live in the brain,","and so what do we know about the causality of this?","Could it be that individuals","who have early onset of say, Alzheimer's,","have then poor sleep kind of as a consequence of that?"],"390":["Yeah, so I think what's really fascinating","is all these bio-directional relationships","that's being identified in animal studies especially,","showing that sleep changes actually occur very early on","in the disease process, so it could be a prodromal stage","of Parkinson's, and also in transgenic model of AD,","they're already showing a lot of circadian abnormalities","in this mouse."],"318":["So within dementia risk in particular,","Alzheimer's for instance,","there are kind of two clear features","that seem to be part of the pathology, right?","So there's beta-amyloid which accumulates in the brain,","and then there's kind of these tangles,","this tauopathies, right?","And so it sounds like sleep seems to be related","to the tauopathies.","What about kind of beta-amyloid?"],"391":["Yes, in the transgenic mouse models of AD,","including those expressing","human mutant amyloid precursor protein,","APP type or both,","so that's kind of showing the sleep changes","in both of these pathologies."],"319":["Okay, so there is this bio-directional piece,","but I think perhaps the most exciting thing","that happened in the sleep field,","at least in my view,","has been understanding the role of sleep","and its clearance of beta-amyloid in the brain.","This idea that sleep is kind of the dishwasher of the brain,","it seems like, that you know A betta accumulates","as we kind of use energy,","and you know it's kind of a waste product,","and the idea that if you don't clear it out,","that it's going to build up and accumulate."],"392":["So the thing I'm most excited about sleep research","is, I think, first of all,","this complexity of the daytime\/nighttime sleep,","what sleep is really doing to our body and to our brain,","and then is really from the epidemiologic","or public health perspective,","how we can best use sleep as a tool for the detection","and prevention of neurodegeneration in the long-term."],"320":["I'm excited about the future of sleep medicine.","I think there are incredible innovations that are happening","in the basic sciences, kind of really starting to understand","what are the clear biological processes","that underly some of these things","as they relate to disease risk,","and what is the true function of sleep,","kind of the why we sleep phenomenon, right?"]},"turn_sentences":{"314":["Good to see you again, Yue."],"387":["Yes, good to see you."],"315":["Really glad that you could join us.","So we've been talking about sleep today, various levels of complexity.","But now with you, I really want to talk about what do we know about sleep and the aging brain.","Can you tell me a little bit about some of the work that you've been doing in that area?"],"388":["So I'm a epidemiologist, so we do a lot of work on the epidemiology of sleep and development of neurodegenerative diseases including both Alzheimer's and Parkinson's disease, so ADMPD.","We mainly work on population studies.","We work on thousands and even millions of population, and we use statistical modeling to find out the association between different sleep disturbances and also genetics related to sleep disturbances and link that to their risk of developing ADMPD."],"316":["So how strong is the link?"],"389":["Our study has found really strong associations looking at these populations, for example, with sleep apnea.","We've done one meta-analysis and it's showed that those with sleep apnea, they have a ratio of 1.26, which means that those who have sleep apnea have 26% elevated risk of developing Alzheimer's compared to those without sleep apnea."],"317":["So it's interesting, so I also saw that there was also a recent meta-analysis around sleep disturbances and dementia risk, and in that study, they looked about 250,000 people in this meta-analysis, and they followed them around for 10 years, and you know, when they pulled all the samples together, they found there was a 1.2 fold increased risk for developing all caused dementia, so it sounds like both sleep apnea and then maybe sleep disturbances more generally are associated with increased risk for dementia.","When I think about that, I think about how sleep lives in the brain, these neurodegenerative diseases live in the brain, and so what do we know about the causality of this?","Could it be that individuals who have early onset of say, Alzheimer's, have then poor sleep kind of as a consequence of that?"],"390":["Yeah, so I think what's really fascinating is all these bio-directional relationships that's being identified in animal studies especially, showing that sleep changes actually occur very early on in the disease process, so it could be a prodromal stage of Parkinson's, and also in transgenic model of AD, they're already showing a lot of circadian abnormalities in this mouse."],"318":["So within dementia risk in particular, Alzheimer's for instance, there are kind of two clear features that seem to be part of the pathology, right?","So there's beta-amyloid which accumulates in the brain, and then there's kind of these tangles, this tauopathies, right?","And so it sounds like sleep seems to be related to the tauopathies.","What about kind of beta-amyloid?"],"391":["Yes, in the transgenic mouse models of AD, including those expressing human mutant amyloid precursor protein, APP type or both, so that's kind of showing the sleep changes in both of these pathologies."],"319":["Okay, so there is this bio-directional piece, but I think perhaps the most exciting thing that happened in the sleep field, at least in my view, has been understanding the role of sleep and its clearance of beta-amyloid in the brain.","This idea that sleep is kind of the dishwasher of the brain, it seems like, that you know A betta accumulates as we kind of use energy, and you know it's kind of a waste product, and the idea that if you don't clear it out, that it's going to build up and accumulate."],"392":["So the thing I'm most excited about sleep research is, I think, first of all, this complexity of the daytime\/nighttime sleep, what sleep is really doing to our body and to our brain, and then is really from the epidemiologic or public health perspective, how we can best use sleep as a tool for the detection and prevention of neurodegeneration in the long-term."],"320":["I'm excited about the future of sleep medicine.","I think there are incredible innovations that are happening in the basic sciences, kind of really starting to understand what are the clear biological processes that underly some of these things as they relate to disease risk, and what is the true function of sleep, kind of the why we sleep phenomenon, right?"]},"turn_num_tokens":{"314":8,"387":7,"315":65,"388":83,"316":7,"389":65,"317":158,"390":69,"318":74,"391":39,"319":109,"392":71,"320":68},"role":{"314":"Explainer","387":"Explainee","315":"Explainer","388":"Explainee","316":"Explainer","389":"Explainee","317":"Explainer","390":"Explainee","318":"Explainer","391":"Explainee","319":"Explainer","392":"Explainee","320":"Explainer"}}