{"topic":{"669":"virtual_reality","693":"virtual_reality","670":"virtual_reality","694":"virtual_reality","671":"virtual_reality","695":"virtual_reality","672":"virtual_reality"},"youtube_link":{"669":"https:\/\/youtu.be\/akveRNY6Ulw?t=23","693":"https:\/\/youtu.be\/akveRNY6Ulw","670":"https:\/\/youtu.be\/akveRNY6Ulw?t=23","694":"https:\/\/youtu.be\/akveRNY6Ulw","671":"https:\/\/youtu.be\/akveRNY6Ulw?t=23","695":"https:\/\/youtu.be\/akveRNY6Ulw","672":"https:\/\/youtu.be\/akveRNY6Ulw?t=23"},"wired_link":{"669":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","693":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","670":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","694":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","671":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","695":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","672":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty"},"dialog_lvl":{"669":"child","693":"child","670":"child","694":"child","671":"child","695":"child","672":"child"},"dialog_id":{"669":"virtual_reality_3","693":"virtual_reality_3","670":"virtual_reality_3","694":"virtual_reality_3","671":"virtual_reality_3","695":"virtual_reality_3","672":"virtual_reality_3"},"speaker_id":{"669":1,"693":2,"670":1,"694":2,"671":1,"695":2,"672":1},"reciever_id":{"669":2,"693":1,"670":2,"694":1,"671":2,"695":1,"672":2},"turn_id":{"669":1,"693":2,"670":3,"694":4,"671":5,"695":6,"672":7},"turn":{"669":["So do you know what virtual reality is?"],"693":["Yes, its simple.","Its like a video game except it feels like","you're in the video game."],"670":["That's actually a really good description.","The idea is that if you've got a system here that can make","you see whatever we want you to see, then we can make you","believe that you're anywhere else, like on top of","a mountain, or in a dungeon or under the ocean."],"694":["Or in Minecraft."],"671":["Yeah, or in Minecraft.","When you look at a TV on the wall there showing like","a picture of a mountain or something,","how can you tell that its not just a window","and there's something else behind it.","Because it always doesn't look quite right","if you have a static picture of a person on a screen","and you move around like this, its not really changing.","And its interesting, those are things we have to figure out","We need to figure out when you look at something in reality","how can you tell whether its real or not.","Have you been to a 3-D movie","where you put on the little glasses?"],"695":["Yeah."],"672":["So what they do, the trick for that is, if you ever","at a theater and you take up the glasses and you look","at it, you'll see its blurry where there's actually","two pictures that they're showing at the same time.","And what those little glasses do, is they let one eye","see one picture, and the other eye see a different picture.","So then your eyes can say, oh it looks like I'm seeing","through the screen or something is floating out","in front of it.","In the VR headsets, what we do is, there's actually either","two screens or one screen split in half,","so that it draws a different picture,","completely different picture, for each eye.","And we make sure that each eye can only","see the picture it intended to.","And that's what can make things feel like they got this real","depth to them, that its something that you could reach out","and touch and it doesn't feel like a flat TV screen."]},"turn_sentences":{"669":["So do you know what virtual reality is?"],"693":["Yes, its simple.","Its like a video game except it feels like you're in the video game."],"670":["That's actually a really good description.","The idea is that if you've got a system here that can make you see whatever we want you to see, then we can make you believe that you're anywhere else, like on top of a mountain, or in a dungeon or under the ocean."],"694":["Or in Minecraft."],"671":["Yeah, or in Minecraft.","When you look at a TV on the wall there showing like a picture of a mountain or something, how can you tell that its not just a window and there's something else behind it.","Because it always doesn't look quite right if you have a static picture of a person on a screen and you move around like this, its not really changing.","And its interesting, those are things we have to figure out We need to figure out when you look at something in reality how can you tell whether its real or not.","Have you been to a 3-D movie where you put on the little glasses?"],"695":["Yeah."],"672":["So what they do, the trick for that is, if you ever at a theater and you take up the glasses and you look at it, you'll see its blurry where there's actually two pictures that they're showing at the same time.","And what those little glasses do, is they let one eye see one picture, and the other eye see a different picture.","So then your eyes can say, oh it looks like I'm seeing through the screen or something is floating out in front of it.","In the VR headsets, what we do is, there's actually either two screens or one screen split in half, so that it draws a different picture, completely different picture, for each eye.","And we make sure that each eye can only see the picture it intended to.","And that's what can make things feel like they got this real depth to them, that its something that you could reach out and touch and it doesn't feel like a flat TV screen."]},"turn_num_tokens":{"669":9,"693":21,"670":59,"694":4,"671":125,"695":2,"672":194},"role":{"669":"Explainer","693":"Explainee","670":"Explainer","694":"Explainee","671":"Explainer","695":"Explainee","672":"Explainer"}}