{"topic":{"682":"virtual_reality","704":"virtual_reality","683":"virtual_reality","705":"virtual_reality","684":"virtual_reality","706":"virtual_reality","685":"virtual_reality","707":"virtual_reality"},"youtube_link":{"682":"https:\/\/youtu.be\/akveRNY6Ulw?t=364","704":"https:\/\/youtu.be\/akveRNY6Ulw","683":"https:\/\/youtu.be\/akveRNY6Ulw?t=364","705":"https:\/\/youtu.be\/akveRNY6Ulw","684":"https:\/\/youtu.be\/akveRNY6Ulw?t=364","706":"https:\/\/youtu.be\/akveRNY6Ulw","685":"https:\/\/youtu.be\/akveRNY6Ulw?t=364","707":"https:\/\/youtu.be\/akveRNY6Ulw"},"wired_link":{"682":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","704":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","683":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","705":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","684":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","706":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","685":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty","707":"https:\/\/www.wired.com\/video\/watch\/oculus-john-carmack-explains-virtual-reality-in-5-levels-of-difficulty"},"dialog_lvl":{"682":"grad","704":"grad","683":"grad","705":"grad","684":"grad","706":"grad","685":"grad","707":"grad"},"dialog_id":{"682":"virtual_reality_6","704":"virtual_reality_6","683":"virtual_reality_6","705":"virtual_reality_6","684":"virtual_reality_6","706":"virtual_reality_6","685":"virtual_reality_6","707":"virtual_reality_6"},"speaker_id":{"682":1,"704":5,"683":1,"705":5,"684":1,"706":5,"685":1,"707":5},"reciever_id":{"682":5,"704":1,"683":5,"705":1,"684":5,"706":1,"685":5,"707":1},"turn_id":{"682":1,"704":2,"683":3,"705":4,"684":5,"706":6,"685":7,"707":8},"turn":{"682":["You know an interesting topic is: what are the limits","to what we can do with virtual reality?","Where I'm pretty pleased with what we have today.","What we can show people and say virtual reality, its cool.","People get an amazing response from it.","But we're still clearly a very, very long ways from reality."],"704":["That kinds of notes back to Realism in our history","and how Realism was a response to Romanticism.","And Realism was meant to capture the mundane,","everyday lives of individuals and not idealize","any of their activities in any way.","And I think that that's really important","for virtual reality.","I think its kind of rite-of-passage for any kind","of our technology to go through."],"683":["Mostly in VR we talk about the display and optics,","the visual side of things,","but we should at least tick off the other senses.","And haptics is an interesting thing about virtual reality","really doesn't have that aspect of touching things.","You can move your hands around, you can do everything","but its a disconnected experience because you know","you don't have an actual solidity there.","And I am pessimistic about progress in haptics technology.","Almost all other areas I'm an optimist and I'm excited","about what's coming up, but I don't have any brilliant","vision about how we're going to revolutionize haptics","and make it feel like we're touching the things","in the virtual world."],"705":["So I've tried the demos, at VRLA there's one that has","waves, like audio waves I believe, that come up","and then you can put your hands through that and feel","the waves whenever you're supposed to be feeling bubbles","or any kind of force field or something.","And those are pretty interesting.","I've seen some pretty interesting things that you can do","with audios, you can cut down a lot of the storage I guess","and the power that you would need in order to power a huge","scene, you can just mimic the sounds of those scenes","actually being there and they're not actually.","For example, a professor at USC would have the sound of","a train drive by without actually rendering the sound.","And you would feel like you're deeply immersed in this world","without having to have such an expensive scene","built around you.","So I think those are pretty significant."],"684":["Yeah, that is one potential quality improvement that","is still on the horizon is when we do spatialization,","we use HRTF, the Head Relative Transfer Function,","to make it sound like its in different places.","But usually we just use this one kind of generic,","here's your average human, HRTF function.","Its possible, that of course, if you are right","in the average then its perfect for you.","But there's always people off to the extremes,","that it doesn't do a very good job at.","And there may be better ways to allow people to sample","their own perfect HRTF which can improve","the audio experience a lot.","It all comes down to all these trade-offs."],"706":["You know, with display and with resolution, its one","of those things where if people have one bad experience","they kind of, oh well everything else.","Its really difficult to build trust again with people","who haven't done VR before but its easy to break off","that trust when they have a bad experience."],"685":["There was a huge concern about that at Oculus.","And the term internally that went around","was poisoning the well.","They were very, very concerned.","I mean for a long time there was a fight about whether","gear VR should even be done, because the worry was","if we let a product go out,","like gear VR that didn't have those things.","That if somebody saw it and it was bad, made them sick,","made their eyes hurt, then they would be like","I'm never going to try VR again.","I tried it that time and it was terrible.","And there was legitimate arguments about whether","it was even a good idea to do that.","And it turned out that yes, its obviously better to have all","those things, but you can still do something","that's valuable for the user without it.","Its weird being at the beginning of a medium like this."],"707":["Right, I'm very excited to see how filmmakers tackle","creating content and those things.","Especially if they're experienced with traditional medium."]},"turn_sentences":{"682":["You know an interesting topic is: what are the limits to what we can do with virtual reality?","Where I'm pretty pleased with what we have today.","What we can show people and say virtual reality, its cool.","People get an amazing response from it.","But we're still clearly a very, very long ways from reality."],"704":["That kinds of notes back to Realism in our history and how Realism was a response to Romanticism.","And Realism was meant to capture the mundane, everyday lives of individuals and not idealize any of their activities in any way.","And I think that that's really important for virtual reality.","I think its kind of rite-of-passage for any kind of our technology to go through."],"683":["Mostly in VR we talk about the display and optics, the visual side of things, but we should at least tick off the other senses.","And haptics is an interesting thing about virtual reality really doesn't have that aspect of touching things.","You can move your hands around, you can do everything but its a disconnected experience because you know you don't have an actual solidity there.","And I am pessimistic about progress in haptics technology.","Almost all other areas I'm an optimist and I'm excited about what's coming up, but I don't have any brilliant vision about how we're going to revolutionize haptics and make it feel like we're touching the things in the virtual world."],"705":["So I've tried the demos, at VRLA there's one that has waves, like audio waves I believe, that come up and then you can put your hands through that and feel the waves whenever you're supposed to be feeling bubbles or any kind of force field or something.","And those are pretty interesting.","I've seen some pretty interesting things that you can do with audios, you can cut down a lot of the storage I guess and the power that you would need in order to power a huge scene, you can just mimic the sounds of those scenes actually being there and they're not actually.","For example, a professor at USC would have the sound of a train drive by without actually rendering the sound.","And you would feel like you're deeply immersed in this world without having to have such an expensive scene built around you.","So I think those are pretty significant."],"684":["Yeah, that is one potential quality improvement that is still on the horizon is when we do spatialization, we use HRTF, the Head Relative Transfer Function, to make it sound like its in different places.","But usually we just use this one kind of generic, here's your average human, HRTF function.","Its possible, that of course, if you are right in the average then its perfect for you.","But there's always people off to the extremes, that it doesn't do a very good job at.","And there may be better ways to allow people to sample their own perfect HRTF which can improve the audio experience a lot.","It all comes down to all these trade-offs."],"706":["You know, with display and with resolution, its one of those things where if people have one bad experience they kind of, oh well everything else.","Its really difficult to build trust again with people who haven't done VR before but its easy to break off that trust when they have a bad experience."],"685":["There was a huge concern about that at Oculus.","And the term internally that went around was poisoning the well.","They were very, very concerned.","I mean for a long time there was a fight about whether gear VR should even be done, because the worry was if we let a product go out, like gear VR that didn't have those things.","That if somebody saw it and it was bad, made them sick, made their eyes hurt, then they would be like I'm never going to try VR again.","I tried it that time and it was terrible.","And there was legitimate arguments about whether it was even a good idea to do that.","And it turned out that yes, its obviously better to have all those things, but you can still do something that's valuable for the user without it.","Its weird being at the beginning of a medium like this."],"707":["Right, I'm very excited to see how filmmakers tackle creating content and those things.","Especially if they're experienced with traditional medium."]},"turn_num_tokens":{"682":66,"704":71,"683":134,"705":173,"684":134,"706":60,"685":173,"707":26},"role":{"682":"Explainer","704":"Explainee","683":"Explainer","705":"Explainee","684":"Explainer","706":"Explainee","685":"Explainer","707":"Explainee"}}